org-lms.org
#+TODO: ACTION(a) STARTED(s) WAITING(w) NEEDSHELP(n) MISSING(m) | DONE(d) WONTDO(o)
#+PROPERTY: header-args    :tangle org-lms.el
#+ORG_LMS_COURSE: wildwater
I'm moving this package to a literate programming format to make it easier to maintain.

Source blocks are tangled using org-babel.

* STARTED Canvas API Docs & docs for some of the packages used.   
- The very extensive Canvas REST API is [[https://canvas.instructure.com/doc/api/][documented in full here]].
- Most institutions also provide a [[[ df [[ [[https://community.canvaslms.com/docs/DOC-14390-canvas-apis-getting-started-the-practical-ins-and-outs-gotchas-tips-and-tricks  [[https://canvas.instructure.com/doc/api/live][live API]], as [[https://community.canvaslms.com/docs/DOC-14390-canvas-apis-getting-started-the-practical-ins-and-outs-gotchas-tips-and-tricks][discussed in this excellent and somewhat hidden document]]. You'll need to use your own institution's instance since you need an auth token; I use [[https://q.utoronto.ca/doc/api/live#!/][the one that University of Toronto provides]]
- The [[https://canvas.instructure.com/doc/api/file.graphql.html][GraphQL API]] is much less well-documented, though it also comes with a live interaction tool; at U of T it's [[https://q.utoronto.ca/graphiql][at this URL]]. 
- Add some docs about request, and maybe dash? 
* Package intro

#+begin_src emacs-lisp
  ;;; org-lms -- Summary
  ;;;
  ;;; Commentary:
  ;;; Library to facilitate marking assignments and interacting
  ;;; with the Canvas LMS (https://canvas.instructure.com/) via its
  ;;; JSON API (https://canvas.instructure.com/doc/api/).
  ;;;
  ;;; Functionality is still rough and design is idiosyncratic. I hope to
  ;;; one day design a more robusti nterface but... who know? 

  ;;; Code:


#+end_src

* COMMENT What does this package contain? 

#+begin_src emacs-lisp :results list :tangle no
(matches-in-buffer "(\\\(defun .*\\\)")

#+end_src

#+RESULTS:
* Dependencies
#+begin_src emacs-lisp
;; require the dependencies
(require 'org) ;; the source of all good!
(require 'org-attach) ;; for attaching files to emails
(require 'cl-lib) ;; may not be necessary anymore in newer Emacsen
(require 'org-mime) ;; Unfortunately I require this somewhat outdated library for mailing
(require 'dash) ;; modern syntax
(require 'ts) ;; easy time manipulation
(require 'oc) ;; citations
(require 'oc-csl) ;; csl citaiont processor
(require 'citeproc) ;; citeproc dependency
(require 'ox-canvashtml) ;; new canvas html processor (experimental)
;; (require 's) ;; modern strings
;; (require 'org-ql) ;; faster, easier query syntax
;;(require 'ov) ;; for grade overlays

#+end_src

#+RESULTS:
: ox-canvashtml

* Define obsolete functions
THere's some stuff I should get rid of. Trying to track it down.  

#+begin_src emacs-lisp
  (define-obsolete-function-alias 'org-lms-send-subtree-with-attachments
    'org-lms~send-subtree-with-attachments "a pretty long time ago")
(define-obsolete-function-alias 'org-lms-mail-all-undone 
    'org-lms-mail-all "a pretty long time ago")
(define-obsolete-function-alias 'org-lms-parse-assignment 
    'org-lms-post-assignment "2021-06-20" "calling this`parse` was misleading")

#+end_src

#+RESULTS:
: org-lms-parse-assignment

* STARTED Variable definitions
The underlying data structure has changed a bit :-) as I start to understand what information needs to be stored in non-textual data structures and what doesn't. A lot of this has not been documented yet!
  
- need to give a better default value to org-lms-courses

#+begin_src emacs-lisp
;; variables
;; most of these are used for canvas interactions...

(defvar org-lms-courses nil
  "Alist in which each car is a symbol, and each cdr is a plist.

  Value of this variable must be set beforeusing the library. The
  plist should include at least the following attributes in order
  to match the local definition with the courses on canvas:

  - `:coursnum' 
  - `:name'
  - `:semester'
  ")

(defcustom org-lms-baseurl nil
  "Baseurl for canvas API queries. 
    Should have the form \"https://canvas.instance.at.school/api/v1/\"."
  :type '(string)
  )

(defcustom org-lms-public-baseurl nil
  "Baseurl for canvas API queries. 
    Should have the form \"https://canvas.instance.at.school/api/v1/\"."
  :type '(string)
  )

(defcustom org-lms-token nil
  "Secret oauth token for Canvas. DO NOT SHARE THIS INFO.
    Probably customize is a rotten place to put this!"
  :type '(string))

(defvar-local org-lms-course nil
  "Locally-set variable representing the local course.")

(defvar-local org-lms-local-assignments nil
  "List of assignments for the current course. 

    Intended to be updated automatically somehow, but for now just
    being set in grading page")

(defvar-local org-lms-merged-assignments nil
  "Buffer-local plist of students in this course, merging cnavas and local info. 

    Intended to be set automatically. Should always be buffer-local")

(defvar-local org-lms-local-students nil
  "Buffer-local plist of students in this course, using local csv file. 

    Intended to be set automatically. Should always be buffer-local")

(defvar-local org-lms-merged-students nil
  "Buffer-local plist of students in this course, merging cnavas and local info. 

    Intended to be set automatically. Should always be buffer-local")
(defcustom ol-make-headings-final-hook nil
  "list of functions to run just after a heading has been created"
  :safe t)

(defcustom org-lms-citeproc-doi-prefix
  "https://dx.doi.org/"
  "Local DOI resolver for student bibliography links")

(defcustom org-lms-citeproc-fmt-alist
  ;; oops, requires dash library!!
  (and (boundp 'citeproc-fmt--html-alist)
       (--map-when (eq  (car it) 'cited-item-no)
                   '(cited-item-no
                     . ;; (lambda (x y) (concat "<a href=\"#slide-bibliography\">" x "</a>"))
                     (lambda (x y) x))
                   citeproc-fmt--html-alist))
  "Alist matching CSL properties to lambda functions that wrap the property values
  in HTML tags; or nil, if CITEPROC-FMT--HTML-ALIST is not defined."
  :group 'org-export-re-reveal
  :type '(alist :key-type symbol :value-type function ))


#+end_src

#+RESULTS:
: org-lms-citeproc-fmt-alist

* NEEDSHELP Set up Testing
Thisi s a complete joke; needs to be entirely rethought. 

Unit tests wil lbe defined throughout and just tangled to a different place! First we have to set up the environment. You'll need to set some of these values up yourself!

#+begin_src emacs-lisp :tangle org-lms-tests.el
  (setq-local default-assignments (org-lms-read-assignment-map
                                   "~/Wildwater/Assignments-ww1.org")
        default-courseid 64706
        default-students (org-lms-merge-student-lists))
#+end_src

* Helper functions
These functions do things like parse csv files, set up json properly, etc.  
** ACTION Debug Messages
I am unfortunately no past the stage of using debug messages :-/
sooo.. write this fing function?  
#+begin_src emacs-lisp :tangle no
(debug-message (message )
(if plaplapla))
#+end_src
** ACTION Read global values of org file
Stolen from [[https://emacs.stackexchange.com/questions/21713/how-to-get-property-values-from-org-file-headers/21715#21715][stackexchange]] via [[https://github.com/zzamboni/dot-emacs/blob/master/init.org#publishing-to-leanpub][Diego Zamboni]], thee functions allow Emacs to see values of props set in the header. 

I need to figure out a setter -- these are just getters.  Something like :

~(insert (concat "#+" (upcase property )))~

*EDIT <2019-09-19 Thu>:* Actually I have my keyword getter  from John Kitchin somewhere; that does a better job. In either case I should make sure that the buffer gets widened inside the function so that everything can be set properly.  
#+begin_src emacs-lisp
  (defun org-lms-global-props (&optional property buffer)
    "Get the plists of global org properties of current buffer."
    (unless property (setq property "PROPERTY"))
    (with-current-buffer (or buffer (current-buffer))
      (org-element-map (org-element-parse-buffer) 'keyword (lambda (el) (when (string-match property (org-element-property :key el)) el)))))

  (defun org-lms-global-prop-value (key)
    "Get global org property KEY of current buffer."
    (org-element-property :value (car (org-lms-global-props key))))
#+end_src

#+RESULTS:
: org-lms-global-prop-value

*TODO* no tests yet!!

