org-lms.el
;;; org-lms -- Summary
;;;
;;; Commentary:
;;; Library to facilitate marking assignments and interacting
;;; with the Canvas LMS (https://canvas.instructure.com/) via its
;;; JSON API (https://canvas.instructure.com/doc/api/).
;;;
;;; Functionality is still rough and design is idiosyncratic. I hope to
;;; one day design a more robusti nterface but... who know? 

;;; Code:

;; require the dependencies
(require 'org) ;; the source of all good!
(require 'org-attach) ;; for attaching files to emails
(require 'cl) ;; may not be necessary anymore in newer Emacsen
(require 'org-mime) ;; Unfortunately I require this somewhat outdated library for mailing
(require 'dash) ;; modern syntax
(require 'ts) ;; easy time manipulation
;; (require 's) ;; modern strings
;; (require 'org-ql) ;; faster, easier query syntax
;;(require 'ov) ;; for grade overlays

(define-obsolete-function-alias 'org-lms-send-subtree-with-attachments
    'org-lms~send-subtree-with-attachments)
(define-obsolete-function-alias 'org-lms-mail-all-undone 
    'org-lms-mail-all)

;; variables
  ;; most of these are used for canvas interactions...

  (defvar org-lms-courses nil
    "Alist in which each car is a symbol, and each cdr is a plist.

  Value of this variable must be set beforeusing the library. The
  plist should include at least the following attributes in order
  to match the local definition with the courses on canvas:

  - `:coursnum' 
  - `:name'
  - `:semester'
  ")

  (defcustom org-lms-baseurl nil
    "Baseurl for canvas API queries. 
    Should have the form \"https://canvas.instance.at.school/api/v1/\"."
    :type '(string)
    )

  (defcustom org-lms-token nil
    "Secret oauth token for Canvas. DO NOT SHARE THIS INFO.
    Probably customize is a rotten place to put this!"
    :type '(string))

  (defvar-local org-lms-course nil
    "Locally-set variable representing the local course.")

  (defvar-local org-lms-local-assignments nil
    "List of assignments for the current course. 

    Intended to be updated automatically somehow, but for now just
    being set in grading page")

  (defvar-local org-lms-merged-assignments nil
    "Buffer-local plist of students in this course, merging cnavas and local info. 

    Intended to be set automatically. Should always be buffer-local")

  (defvar-local org-lms-local-students nil
    "Buffer-local plist of students in this course, using local csv file. 

    Intended to be set automatically. Should always be buffer-local")

  (defvar-local org-lms-merged-students nil
    "Buffer-local plist of students in this course, merging cnavas and local info. 

    Intended to be set automatically. Should always be buffer-local")
(defcustom ol-make-headings-final-hook nil
  "list of functions to run just after a heading has been created"
  :safe t)

(defun org-lms-global-props (&optional property buffer)
  "Get the plists of global org properties of current buffer."
  (unless property (setq property "PROPERTY"))
  (with-current-buffer (or buffer (current-buffer))
    (org-element-map (org-element-parse-buffer) 'keyword (lambda (el) (when (string-match property (org-element-property :key el)) el)))))

(defun org-lms-global-prop-value (key)
  "Get global org property KEY of current buffer."
  (org-element-property :value (car (org-lms-global-props key))))
