org-lms.org
** ACTION Reading keywords in org files
:PROPERTIES:
:ORG_LMS_COURSE: calmwater
:END:

From a discussion w/ john kitchin, Nicolas Goaziou, ando thers, how to as itwre "define" a new keyword without the elabotrate  apparatus of an org exporter. 

*TODO:* don't forget to actually start using this

- GETTER :: 

#+begin_src emacs-lisp :results code


;; john kitchin's version
;; (defun org-lms-get-keyword (key &optional buffer)

;;   (org-element-map (org-element-parse-buffer) 'keyword
;;     (lambda (k)
;;       (when (string= key (org-element-property :key k))
;;         (org-element-property :value k))) 
;;     nil t))


(defun org-lms-get-keyword (key &optional file)
  (save-excursion
    (let ((result nil)
          (buf (current-buffer))
          )
      
      (if file 
          (setq buf (find-file-noselect file)))
      (with-current-buffer buf
        (save-restriction
          (widen)
          (let ((setup (org-element-map
                           (org-element-parse-buffer)
                           'keyword
                         (lambda (k)
                           (when (string= "SETUPFILE" (org-element-property :key k))
                             (org-element-property :value k)))
                         nil t)))
            (setq result
                  (or
                   (org-element-map (org-element-parse-buffer) 'keyword
                     (lambda (k)
                       (when (string= key (org-element-property :key k))
                         (setq result  (org-element-property :value k)))
                       result) 
                     nil t)
                   (and setup
                        (org-lms-get-keyword key setup ))
                   ))))))))

;; nicolas g's version
;; (defun org-lms-get-keyword (key)
;;   "Get value of keyword, whether or not it's been defined by org. 

;; Look for a keyword statement of the form 
;; #+KEYWORD: 

;; and return either the last-declared value of the keyword, or the
;; value of the current headline's property of the same name."

;;   (let ((case-fold-search t)
;;         (regexp (format "^[ \t]*#\\+%s:" key))
;;         (result nil))
;;     (org-with-point-at 1
;;       (while (re-search-forward regexp nil t)
;;         (let ((element (org-element-at-point)))
;;           (when (eq 'keyword (org-element-type element))
;;             (push (org-element-property :value element) result)))))
;;     (or (org-entry-get nil key) (car result)))
;;   )



(defun org-lms-set-keyword (tag value)
  "Set filetag TAG to VALUE.
        If VALUE is nil, remove the filetag."
  (save-excursion
    (goto-char (point-min))
    (if (re-search-forward (format "#\\+%s:" tag) (point-max) 'end)
        ;; replace existing filetag
        (progn
          (beginning-of-line)
          (kill-line)
          (when value
            (insert (format "#+%s: %s" tag value))))
      (goto-char (point-min))
      ;; add new filetag
      (if (looking-at "^$") 		;empty line
          ;; at beginning of line
          (when value
            (insert (format "#+%s: %s\n" tag value)))
        ;; at end of some line, so add a new line
        (when value
          (insert (format "#+%s: %s\n" tag value)))))))
#+end_src

