org-lms.org
** ACTION CSV Parsers
There are several of these here. The code is largely redundant and should be combined into one or two
#+begin_src emacs-lisp
  ;; Helper Functions

  ;; I'm using hte namespace `org-lms~' for these internal helper functions.
  ;; At some liater date should figure out and implement approved best
  ;; oractices. 

  ;; CSV Parsers
  ;; Student information (name, email, etc) is exported from excel or blackboard in the form
  ;; of a CSV file.  These two functions parse such files

  (defun org-lms~parse-csv-file (file)
    "Transforms FILE into a list.
   Each element of the returned value is itself a list
  containing all the elements from one line of the file.
  This fn was stolen from somewhere on the web, and assumes
  that the file ocntains no header line at the beginning"
    (interactive
     (list (read-file-name "CSV file: ")))
    (let ((buf (find-file-noselect file))
          (result nil))
      (with-current-buffer buf
        (goto-char (point-min))
        ;; (let ((header (buffer-substring-no-properties
        ;;              (line-beginning-position) (line-end-position))))
        ;;   (push ))
        (while (not (eobp))
          (let ((line (buffer-substring-no-properties
                       (line-beginning-position) (line-end-position))))
            ;; (let templist (split-string line ",")
            ;;      ;;(print templist)
            ;;      ;; (push (cons (car templist) (nth 1 templist) ) result)
            ;;      )
            (push (cons (nth 0 (split-string line ",")) (nth 1 (split-string line ","))) result)
            )
          (forward-line 1)))
      (reverse result)))

  (defun org-lms~parse-plist-symbol-csv-file (file)
    "Transforms csv FILE into a list of plists.
  Like `parse-csv-file' but each line of the original file is
  turned into a plist. Returns a list of plists. Column header
  strings are transformed into downcased single-word keys, e.g.
  \"First Name\" becomes \":firstname\". Assumes that the first
  line of the csv file is a header containing field names. Clumsily
  coded, but works."
    (interactive
     (list (read-file-name "CSV file: ")))
    (message "here i am w/ %s" file)
    (let (;; (buf (find-file-noselect file))
          (result nil))
      (with-temp-buffer
        (if (file-exists-p (expand-file-name file)) (insert-file-contents (expand-file-name file)))
        (goto-char (point-min))
        (let ((header-props
               (split-string  (buffer-substring-no-properties
                               (line-beginning-position) (line-end-position)) ","))
              )
         (message "CSV PARSER: headerprops ;; %s" (buffer-string))
          (while (not (eobp))
            (let ((line  (split-string (buffer-substring-no-properties
                                        (line-beginning-position) (line-end-position)) ","))
                  (count 0)
                  (new-plist '()))
              (while (< count (length line))
                (message "here in loop w count %s of " count (length line))
                (setq new-plist (plist-put new-plist
                                           (intern (concat ":"
                                                           (downcase
                                                            (replace-regexp-in-string "\"" ""
                                                                                      (replace-regexp-in-string
                                                                                       "[[:space:]]" ""
                                                                                       (nth count header-props))))))
                                           (if (not (equal (nth count line) "false"))
                                               (replace-regexp-in-string "\"" "" 
                                                                         (nth count line))
                                             "")))
                (setq count (1+ count)))
              (push  new-plist result)
              (forward-line 1))))
        ;; (message "PARSER: result -- %s" result)
        (cdr (reverse result)))))
  (defun org-lms~parse-plist-csv-file (file)
    "Transforms csv FILE into a list of plists.
  Like `parse-csv-file' but each line of the original file is turned 
  into a plist.  Returns a list of plists. Assumes that the first line
  of the csv file is a header containing field names.  Clumsily coded, 
  but works."
    (interactive
     (list (read-file-name "CSV file: ")))
    (let ((buf (find-file-noselect file))
          (result nil))
      (with-current-buffer buf
        (goto-char (point-min))
        (let ((header-props
               (split-string  (buffer-substring-no-properties
                               (line-beginning-position) (line-end-position)) ","))
              )
          ;; (message "CSV PARSER: headerprops ;; %s" header-props)
          (while (not (eobp))
            (let ((line  (split-string (buffer-substring-no-properties
                                        (line-beginning-position) (line-end-position)) ","))
                  (count 0)
                  (new-plist '()))
              (while (< count (length line))
                (setq new-plist (plist-put new-plist
                                           (intern
                                            (replace-regexp-in-string "\"" ""
                                                                      (replace-regexp-in-string
                                                                       "[[:space:]]" ""
                                                                       (nth count header-props))))
                                           (if (not (equal (nth count line) "false"))
                                               (replace-regexp-in-string "\"" "" 
                                                                         (nth count line))
                                             "")))
                (setq count (1+ count)))
              (push  new-plist result)
              (forward-line 1))))
        ;; (message "PARSER: result -- %s" result)
        (cdr (reverse result)))))
#+end_src

#+RESULTS:
: org-lms~parse-plist-csv-file

no tests yet!
** Miscellaneous Helper functions
- navigate org trees w/ ~org-lms-get-parent-headline
- execute plist-get but return empty string (~""~) )instead of ~nil~ when element is absent/nil.  

Neither of these is heavily-used and the latter can be safely replaced by ~(format "%s")~ :-/ 

- ol2ns -- isn't used as much as it could be, either use ocnsistently or remove! 

#+begin_src emacs-lisp
;; Element tree navigation
;; not sure but I don't think I use this anymore
;; also trying to avoid relying on parental properties
;; remove in future
(defun org-lms~get-parent-headline ()
  "Acquire the parent headline & return. Used by`org-lms-make-headlines' and `org-lms-attach'"
  (save-excursion
    (org-up-heading-safe)
    (nth 4 (org-heading-components))
    ;;(org-mark-subtree)
    ;;(re-search-backward  "^\\* ")
    ;;(nth 4 (org-heading-components))
    ))
(defun org-lms-safe-pget (list prop)

  (if (plist-get list prop)
       
      (plist-get list prop)
    ""))

(defun oln2s (num)
  (cond
   ((numberp num)
    (number-to-string num))
   ((stringp num )
    num)
   (num
    (format "%s" num))
   (t
    "")))

;;copied and modified from https://github.com/jorendorff/dotfiles/blob/master/.emacs
;; should be replaced by emacs-kv
(defun org-lms-plist-to-alist (ls)
  "Convert a plist to an alist. Primarily for old color-theme themes."
  (let ((result nil))
    (while ls
      (add-to-list 'result (cons (intern (substring  (symbol-name (car ls)) 1 )) (cadr ls)))
      (setq ls (cddr ls)))
    result))

#+end_src

