org-lms.org
** JSON helpers and wrappers
Intended to make it easier to read and write json according to the library's standards.
- ol-jsonwrapper :: macro to set ~json.el~ vars temporarily around a ~json-read~ call
- ol-write-json-plists :: either there's a bug or I'm not understanding something; without thissetting lists of plists were being interpreted wrong by json-encode.
-  :: 
#+begin_src emacs-lisp
;; number-to-string was driving me crazy 


(defmacro ol-jsonwrapper (fn &rest args)
  "Run FN with ARGS, but first set `json.el' vars to `org-lms' defaults.
Allows org-lms functions to easily parse json consistently. The org-lms
default values are:
`json-array-type': 'list
`json-object-type': 'plist
`json-false': nil
`json-key-type': 'keyword"
  
  `(let ((json-array-type 'list)
         (json-object-type 'plist)
         (json-key-type 'keyword)
         (json-false nil)
         (json-encoding-pretty-print nil))
     (,fn ,@args)
     )

  )

(defun ol-write-json-plists (metalist)
  "Work around json bug with lists of plists (METALIST)."
  (ol-jsonwrapper 
   (lambda ()
     (let ((result "["))
       (cl-loop for s in metalist
                do
                (setq result (concat result
                                     (json-encode-plist s) "," )))
       (concat result "]")))
   )
  )

;; this isn't necessary actually!
(defun ol-write-json-alists (metalist)
  "Work around json bug with lists of plists (METALIST)."
  (ol-jsonwrapper 
   (lambda ()
     (let ((result "["))
       (cl-loop for s in metalist
                do
                (setq result (concat result
                                     (json-encode-alist s) "," )))
       (concat result "]")))
   )
  )

#+end_src

#+RESULTS:
: ol-write-json-alists

** Read-lines: Belongs up with the utility functions

#+begin_src emacs-lisp
;; stolen from xah, http://ergoemacs.org/emacs/elisp_read_file_content.html
(defun org-lms~read-lines (filePath)
  "Return a list of lines of a file at filePath."
  (with-temp-buffer
    (insert-file-contents filePath)
    (split-string (buffer-string) "\n" t)))


#+end_src

** Parse and set properties
Much of the code in this library reads and sets properties at the headline level.  These helpers should increase readability and maintainability. We use ~let-alist~ to set headline-level variables accessed with ~org-lms-process-props~, and set those properties using a dictionary-like map of Canvas API response property names to org-lms headline properties.  

#+NAME:lms-process
#+begin_src emacs-lisp
(defun org-lms-process-props () 
"retrieve all properties in a headline, then downcase and standardize the key names so that they are convenient to use with `let-alist`"
(cl-loop for (key . value) in (org-entry-properties)
         collect
         (cons (intern
                (replace-regexp-in-string
                 "^org_lms_" "ol_"
                 (downcase key)))
               (if (string= "nil" value)
                   nil
                 value ))))

(defun org-lms-propertize-response-data (response-data)
   "write a variable value to a headline property. MUNGED-VAR is a dot-variable set by `let-alist`, 
which see for more details"
   (let ((propDictionary
          '((:id .  "CANVASID")
            (:published . "OL_PUBLISH")
            (:html_url . "CANVAS_HTML_URL")
            (:submission_url . "CANVAS_SUBMISSION_URL")
            (:submissions_download_url . "SUBMISSIONS_DOWNLOAD_URL:")
            (:grading_standard_id . "GRADING_STANDARD_ID")
            (:submission_types . "CANVAS_SUBMISSION_TYPES")
            (:grading_type . "GRADING_TYPE"))))
     (cl-loop for (k . v) in propDictionary
              do
              (if (plist-get response-data k)
                  (progn
                    (message "yup, got prop %s" k)
                    (org-set-property v (format "%s" (plist-get response-data k))))
                (message "nope, no prop %s" k))
              ;; collect
              ;; `(,k . ,(plist-get response-data k))
              )
            
   ))
#+end_src

#+RESULTS: lms-process
: org-lms-propertize-response-data

#+RESULTS:
: org-lms-set-prop

** Deal with timestamps
#+begin_src emacs-lisp
(require 'ts)
(defun o-l-date-to-timestamp (date)
  "use ts.el date parse functions return an ISO-compatible
timestamp for transmission to Canvas via API. DATE is a string,
usually of the form `2019-09-26`, but optionally including a full time."

  (ts-format "%Y-%m-%dT%H:%M:%S%:z" (ts-parse-fill 'end date )))
#+end_src

#+RESULTS:
: o-l-date-to-timestamp

** ACTION Generic get-valid-subtree function.

This function, which is [[https://github.com/kaushalmodi/ox-hugo/blob/b5672ea8925eaff93c4e17982b35acec302ba5e7/ox-hugo.el#L3617][taken directly from ox-hugo]] and is effectively (c) Kaushal Modi under GPL-3.0, *moves point* to the parent subtree and should always be wrapped in a save-excursion.  Most of the export functions above should also now get wrapper functions for wim-scope, and end users could be expected to mostly use those (rather than the existing functions). 

Needs to be documented in README
#+begin_src emacs-lisp
(defun org-lms--get-valid-subtree ()
  "Return the Org element for a valid Hugo post subtree.
The condition to check validity is that the EXPORT_FILE_NAME
property is defined for the subtree element.
As this function is intended to be called inside a valid Hugo
post subtree, doing so also moves the point to the beginning of
the heading of that subtree.
Return nil if a valid Hugo post subtree is not found.  The point
will be moved in this case too."
  (catch 'break
    (while :infinite
      (let* ((entry (org-element-at-point))
             (fname (org-string-nw-p (org-element-property :EXPORT_FILE_NAME entry)))
             level)
        (when fname
          (throw 'break entry))
        ;; Keep on jumping to the parent heading if the current
        ;; entry does not have an EXPORT_FILE_NAME property.
        (setq level (org-up-heading-safe))
        ;; If no more parent heading exists, break out of the loop
        ;; and return nil
        (unless level
          (throw 'break nil))))))

#+end_src

#+RESULTS:
: org-lms--get-valid-subtree

* Talking to Canvas - Fundamentals
Everything in here should be generically useful, and segregated from my unique workflow. That means, among other things, that there should be a specific relationship to an API endpoint. 
** Doc: Functions to interact with specific parts of the Canvas API
This is a lot of the bulk of the library; these convenience functions make it easier to ask Canvas for specific, requently-requested kinds of information.

Organization:
- GETTERS :: for each supported endpoint, write a simple convenience function using ~org-lms-canvas-request~ to GET json data from endpoint
- SETTERS :: for each supported endpoint, write a simple convenience function using ~org=lms-canvas-request~ to POST or PUT json data to endpoint
- TRANSFORMERS :: where appropriate, write additional functions to translate canvas data into a form compatible with local data  

 Supported Endpoints

| Name              | Getter              | Setter | Transformer | API Reference |
|-------------------+---------------------+--------+-------------+---------------|
| courses           | org-lms-get-courses | --     | --          |               |
| assignments       |                     |        |             |               |
| submissions       |                     |        |             |               |
| announcements     |                     |        |             |               |
| grading standards |                     |        |             |               |
| syllabus          |                     |        |             |               |
| users/students    |                     |        |             |               |
| pages             |                     |        |             |               |

Planned Endpoints

| Name                     | Getter | Setter | Transformer | API Reference |
|--------------------------+--------+--------+-------------+---------------|
| course modules           |        |        |             |               |
| discussions              |        |        |             |               |
| conversations            |        |        |             |               |
| custom gradebook columns |        |        |             |               |
| calendar events          |        |        |             |               |
|                          |        |        |             |               |


No Plans Yet

- Everything else!
