org-lms.org
*** tests
Implemented:
- org-lms-get-courses
- org-lms-get-courseids
- org-lms-get-single-course

TODO: 
- org-lms-infer-course
- 
#+begin_src emacs-lisp :tangle org-lms-tests.el :results code
     (ert-deftest org-lms-test-course-functions ()
     "tests the output of org-lms-get-courseids"
     (should (equal (org-lms-get-courses) '((:id 83085 :name "AODA Training Module 3" :account_id 303 :uuid "jKuVq1zF8L9OdRhW7S4wlPix7wYsEGihgxDh4b83" :start_at "2018-07-31T19:46:33Z" :grading_standard_id nil :is_public :json-false :created_at "2018-07-27T18:10:12Z" :course_code "HR-AODA-3" :default_view "wiki" :root_account_id 1 :enrollment_term_id 1 :end_at nil :public_syllabus :json-false :public_syllabus_to_auth :json-false :storage_quota_mb 3000 :is_public_to_auth_users :json-false :term
         (:id 1 :name "Default Term" :start_at nil :end_at nil :created_at "2017-10-20T17:47:47Z" :workflow_state "active" :grading_period_group_id nil)
         :apply_assignment_group_weights :json-false :calendar
         (:ics "https://q.utoronto.ca/feeds/calendars/course_jKuVq1zF8L9OdRhW7S4wlPix7wYsEGihgxDh4b83.ics")
         :time_zone "America/New_York" :blueprint :json-false :enrollments
         ((:type "student" :role "StudentEnrollment" :role_id 3 :user_id 84412 :enrollment_state "active"))
         :hide_final_grades t :workflow_state "available" :restrict_enrollments_to_course_dates :json-false)
    (:id 71671 :name "HIS393H1 S LEC0101 20191:Digital History" :account_id 70 :uuid "nslxGN7BH5RimQx70mvb4kike615qeXBqyqAp0jC" :start_at nil :grading_standard_id 15 :is_public t :created_at "2018-06-20T05:31:41Z" :course_code "HIS393H1 S LEC0101" :default_view "syllabus" :root_account_id 1 :enrollment_term_id 41 :end_at nil :public_syllabus :json-false :public_syllabus_to_auth :json-false :storage_quota_mb 3000 :is_public_to_auth_users :json-false :term
         (:id 41 :name "2019 Winter" :start_at nil :end_at "2020-04-30T04:00:00Z" :created_at "2018-06-20T05:30:22Z" :workflow_state "active" :grading_period_group_id nil)
         :apply_assignment_group_weights :json-false :calendar
         (:ics "https://q.utoronto.ca/feeds/calendars/course_nslxGN7BH5RimQx70mvb4kike615qeXBqyqAp0jC.ics")
         :time_zone "America/New_York" :blueprint :json-false :sis_course_id "HIS393H1-S-LEC0101-20191" :integration_id nil :enrollments
         ((:type "teacher" :role "TeacherEnrollment" :role_id 4 :user_id 84412 :enrollment_state "active"))
         :hide_final_grades t :workflow_state "unpublished" :restrict_enrollments_to_course_dates :json-false)
    (:id 35724 :name "Matthew Price's Sandbox" :account_id 3 :uuid "Ily3E2cFNsBQvhYzSdf6dpjYjY6uaTnXCAcEVjKV" :start_at nil :grading_standard_id nil :is_public nil :created_at "2017-12-06T21:59:44Z" :course_code "Matthew Price's Sandbox" :default_view "modules" :root_account_id 1 :enrollment_term_id 1 :end_at nil :public_syllabus :json-false :public_syllabus_to_auth :json-false :storage_quota_mb 3000 :is_public_to_auth_users :json-false :term
         (:id 1 :name "Default Term" :start_at nil :end_at nil :created_at "2017-10-20T17:47:47Z" :workflow_state "active" :grading_period_group_id nil)
         :apply_assignment_group_weights :json-false :calendar
         (:ics "https://q.utoronto.ca/feeds/calendars/course_Ily3E2cFNsBQvhYzSdf6dpjYjY6uaTnXCAcEVjKV.ics")
         :time_zone "America/New_York" :blueprint :json-false :sis_course_id "pricemat-sandbox" :integration_id nil :enrollments
         ((:type "teacher" :role "TeacherEnrollment" :role_id 4 :user_id 84412 :enrollment_state "active"))
         :hide_final_grades :json-false :workflow_state "unpublished" :restrict_enrollments_to_course_dates :json-false)
    (:id 64706 :name "NEW271H1 F LEC0201 20189:Interdisciplinary Special Topics" :account_id 85 :uuid "wTsoMexdJLKF3SURRtyR9f2QM42vHVh4UfK0g61N" :start_at nil :grading_standard_id 15 :is_public t :created_at "2018-05-25T05:31:01Z" :course_code "NEW271H1 F LEC0201" :default_view "wiki" :root_account_id 1 :enrollment_term_id 39 :end_at nil :public_syllabus t :public_syllabus_to_auth :json-false :storage_quota_mb 3000 :is_public_to_auth_users :json-false :term
         (:id 39 :name "2018 Fall" :start_at nil :end_at "2020-01-01T05:00:00Z" :created_at "2018-05-02T05:17:34Z" :workflow_state "active" :grading_period_group_id nil)
         :apply_assignment_group_weights :json-false :calendar
         (:ics "https://q.utoronto.ca/feeds/calendars/course_wTsoMexdJLKF3SURRtyR9f2QM42vHVh4UfK0g61N.ics")
         :time_zone "America/New_York" :blueprint :json-false :sis_course_id "NEW271H1-F-LEC0201-20189" :integration_id nil :enrollments
         ((:type "teacher" :role "TeacherEnrollment" :role_id 4 :user_id 84412 :enrollment_state "active"))
         :hide_final_grades t :workflow_state "available" :course_format "on_campus" :restrict_enrollments_to_course_dates :json-false))))
     (should (equal (org-lms-get-courseids) '((83085 "#+ORG_LMS_COURSEID: 83085" "AODA Training Module 3")
                                              (71671 "#+ORG_LMS_COURSEID: 71671" "HIS393H1 S LEC0101 20191:Digital History")
                                              (35724 "#+ORG_LMS_COURSEID: 35724" "Matthew Price's Sandbox")
                                              (64706 "#+ORG_LMS_COURSEID: 64706" "NEW271H1 F LEC0201 20189:Interdisciplinary Special Topics")) ))
     (should (equal (org-lms-get-single-course 83085) '(:id 83085 :name "AODA Training Module 3" :account_id 303 :uuid "jKuVq1zF8L9OdRhW7S4wlPix7wYsEGihgxDh4b83" :start_at "2018-07-31T19:46:33Z" :grading_standard_id nil :is_public :json-false :created_at "2018-07-27T18:10:12Z" :course_code "HR-AODA-3" :default_view "wiki" :root_account_id 1 :enrollment_term_id 1 :end_at nil :public_syllabus :json-false :public_syllabus_to_auth :json-false :storage_quota_mb 3000 :is_public_to_auth_users :json-false :apply_assignment_group_weights :json-false :calendar
     (:ics "https://q.utoronto.ca/feeds/calendars/course_jKuVq1zF8L9OdRhW7S4wlPix7wYsEGihgxDh4b83.ics")
     :time_zone "America/New_York" :blueprint :json-false :enrollments
     ((:type "student" :role "StudentEnrollment" :role_id 3 :user_id 84412 :enrollment_state "active"))
     :hide_final_grades t :workflow_state "available" :restrict_enrollments_to_course_dates :json-false))))
  (org-lms-get-courseids )
  (org-lms-get-single-course 83085)
     ;;(org-lms-get-courses)
#+end_src

** Syllabus

The syllabus has a special status in Canvas, so is handled separately here
The syllabus is posted as an attribute of the course element. See [[https://canvas.instructure.com/doc/api/courses.html#method.courses.update][the API docs for a little more info]].  +*DOES NOT SEEM TO BE WORKING ON MY UNIVERSITY'S SYSTEM RIGHT NOW, SEE [[https://community.canvaslms.com/message/126301-how-cna-i-tell-if-i-have-permisison-to-post-a-syllabus][my canvas community post]] for more details!*+ Fixed; w

*** ACTION Getter 
Not Implemented 
*** Setter

#+begin_src emacs-lisp
(defun org-lms-post-syllabus (&optional courseid subtreep)
  "Post  syllabus to course"
  (interactive)
  (setq courseid (or courseid
                     (org-lms-get-keyword "ORG_LMS_COURSEID")
                     (plist-get org-lms-course :id)))
  ;; (cl-flet ((org-html--build-meta-info
  ;;              (lambda (&rest args) "")))
  ;;     ;; (prin1 (symbol-function  'org-html--build-meta-info))
  ;; )
  (let* (;;(org-export-with-toc nil)
         ;;(org-export-with-smart-quotes nil)
         (org-html-postamble nil)
         (org-html-preamble nil)
         (org-html-xml-declaration nil)
         (org-html-head-include-scripts nil)
         (org-html-head-include-default-style nil)
         (org-html-klipsify-src nil)
         (org-export-with-title nil)
         (citeproc-fmt--doi-link-prefix
           "https://doi-org.myaccess.library.utoronto.ca/")
         (citeproc-fmt--formatters-alist
          `((html . ,(citeproc-formatter-create
	              :rt (citeproc-formatter-fun-create org-lms-citeproc-fmt-alist)
	              :bib #'citeproc-fmt--html-bib-formatter))))
         (atext (org-export-as 'canvas-html subtreep nil t))
         (is_public (or (org-lms-get-keyword "IS_PUBLIC") t))
         (license (or (org-lms-get-keyword "LICENSE") "cc_by_nc_sa"))
         (default_view (or (org-lms-get-keyword "DEFAULT_VIEW" )"syllabus"))
         (grading_standard_id (or (org-lms-get-keyword "GRADING_STANDARD_ID") 15 ))
         
         ;;(response (org-lms-get-single-course courseid))
         (data-structure `(("course" . (
                                         ("syllabus_body" . ,atext)
                                        ("is_public" . ,is_public)
                                        ("grading_standard_id" . ,grading_standard_id)
                                        ("license" . ,license)
                                        ;;("default_view" . ,default_view)
                                        ("license" . ,license)
                                        ))))
         (response (org-lms-canvas-request
                    (format  "courses/%s" courseid) "PUT" data-structure ))
         )
    (write-region (json-encode data-structure) nil "/home/matt/syl.json")
    ;;(setq response)
    
    (message "Response: %s" response)
    ( if response
        (org-lms-set-keyword "SYLLABUS_URL" (format "%s/%s/assignments/syllabus"
                                                    ;;org-lms-baseurl
                                                    ;;fix this!
                                                    "https://q.utoronto.ca/courses"
                                                    courseid))) 
    ))

#+end_src

#+RESULTS:
: org-lms-post-syllabus

*** Tests
This will have to be a bit more clever -- need to add some context and "with temp buffer" stuff here I think.  

** Custom Gradebook Columns
:PROPERTIES:
:GRADE:    1
:END:
Exploring this as a way to store nicknames and github IDs.  Doesn't seem any easier than whay I already have, except that if I end up in the canvas interface I'll be able to see my data.

#+begin_src emacs-lisp
  (defun org-lms-post-gb-column (title &optional columnid position teachernotes courseid)
      (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
      (org-lms-canvas-request
       (format "courses/%s/custom_gradebook_columns%s" courseid (if columnid (concat "/" columnid) "")) (if columnid "PUT" "POST") 
       `(("column[title]" . ,title)
         ;;,(if position ("column[position]" . position))
         ;;,(if teachernotes ("column[teacher_ notes]" . teachernotes))
         ))
      )

  (defun org-lms-get-gb-column-data (columnid &optional courseid)
                          (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
                          (org-lms-canvas-request
                           (format "courses/%s/custom_gradebook_columns/%s/data" courseid columnid) "GET" nil 
                           )
                          )

  (defun org-lms-get-gb-columns ( &optional courseid)
    (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
    (org-lms-canvas-request
     (format "courses/%s/custom_gradebook_columns/" courseid) "GET" nil 
     )
    )


  (defun org-lms-post-gb-column-data ( data &optional courseid)
    "Post DATA to custom grading columns in the gradebook for COURSEID.
  Data should be a list of 3-cell alists, in which the values of `column_id',
  `user_id', and `example_content' are set for each entity."
    (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
    (org-lms-canvas-request
     (format "courses/%s/custom_gradebook_column_data" courseid ) "PUT" data 
     )
    )
#+end_src


#+RESULTS:
: org-lms-post-gb-column-data

