org-lms.org
** Students and Users
- org-lms-get-students :: get students in a course
- org-lms-get-all-users :: also get the non-student users in a course
- org-lms-get-single-user :: get just one user (usally as student with id)
- org-lms-merge-student-lists :: merge local and LMS student definitions

No Setters here! We don't add or remove students from the class via the API.  
*** Getters
#+begin_src emacs-lisp

(defun org-lms-get-students (&optional courseid)
    "Retrieve Canvas student data for course with id COUSEID"
    (let* ((courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID")))
;; (courseid (plist-get course :id))
           (result
            (org-lms-canvas-request (format "courses/%s/users" courseid) "GET"
                                    '(("enrollment_type" . ("student"))
                                      ("include" . ("email"))
                                      ("per_page" . 500 )))))
      ;;(message "RESULTS")
      ;;(with-temp-file "students-canvas.json" (insert result))
      (cl-loop for student in-ref result
            do
            (if (string-match "," (plist-get student :sortable_name))
                (let ((namelist  (split-string (plist-get student :sortable_name) ", ")))
                  (plist-put student :lastname (car namelist) )
                  (plist-put student :firstname (cadr namelist)))))
      result))

  (defun org-lms-get-all-users (&optional courseid)
  "Retrieve all users from the course with id COURSEID."
  (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
    (org-lms-canvas-request (format "courses/%s/users" courseid) "GET" '(("per_page" . 500))))

  (defun org-lms-get-single-user (studentid &optional courseid)
    (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
    (org-lms-canvas-request (format "courses/%s/users/%s" courseid  studentid) "GET"))

  (defun org-lms-find-local-user (id)
    (let* ((result nil))
      (cl-loop for s in org-lms-merged-students
               if (equal id (number-to-string (plist-get s :id)))
               do
               (setq result s))
      result))
#+end_src

*** Transformer -- merging student lists
We set the local student list, though we can't/shouldn't set the upstream student list from here, it's too dangerous. 
#+begin_src emacs-lisp
;; fix broken symbol not keyword assignment!!!
(defun org-lms-merge-student-lists (&optional local canvas)
  "Merge student lists, optionally explicity named as LOCAL and CANVAS."

  (unless local
    (setq local (org-lms-get-local-students))
    )
  (unless canvas
    (setq canvas (org-lms-get-students)))

  ;;(message "%s" local)
 (if local 
  (cl-loop for c in-ref canvas
        do (let* ((defn c)
                  (email (plist-get defn :email)))
             (cl-loop for l in-ref local
                   if (string=  email  (plist-get l :email))
                   do
                   (progn 
                     (plist-put defn :github (plist-get l :github))
                     (if (plist-get l :nickname)
                         (progn
                           (plist-put defn :nickname (plist-get l :nickname))
                           (plist-put defn :short_name (plist-get l :nickname))))
                     (unless (plist-get c :firstname)
                       (plist-put defn :firstname (plist-get l :firstname)))
                     (unless (plist-get c :lastname)
                       (plist-put defn :lastname (plist-get l :lastname)))
                     
                 )))))
  (with-temp-file "students-merged.json" (insert  (ol-write-json-plists canvas)))
  canvas)

#+end_src

#+RESULTS:
: org-lms-merge-student-lists

** STARTED  Pages

[[https://canvas.instructure.com/doc/api/pages.html][Canvas pages object documentation]]

*** Getter -- get all pages

#+begin_src emacs-lisp
(defun org-lms-get-all-pages () 
"get all pages as a list of plists"
(interactive)
(org-lms-canvas-request
 (format "courses/%s/pages" (org-lms-get-keyword "ORG_LMS_COURSEID"))
 nil nil))

(defun org-lms-collect-page-links ()
  (let* ((pages (org-lms-get-all-pages))
         (orgList 
          (cl-loop for p in pages
                   concat (format "- [[%s][%s]]\n" (plist-get p :html_url)(plist-get p :title))
                   )))
    orgList))

#+end_src

#+RESULTS:
: org-lms-collect-page-links

