org-lms.org
*** ACTION Setters

I don't believe these are working! Need to get it done so that can be added as a hook to the end of other setters. 

Here are the module possibilities
module[name] 	Required 	string 	

The name of the module
module[unlock_at] 		DateTime 	
module[position] 		integer 	
module[require_sequential_progress] 		boolean 	
module[prerequisite_module_ids][] 
module[publish_final_grade]

Edit <2021-07-05 Mon>: An interesting little piece of code from Tyson, who uses emoji to code his module titles. which is kinda cool.

#+begin_quote
For /Teaching Presence/, I've aimed for consistency in how materials are organised and labelled in modules but also in handouts, live classes, and recorded lessons. You'll notice:

-in front of course documents\\
-in front of assessments\\
in front of core texts\\
-in front of handouts that require activity\\
- in front of videos (recorded lessons or outside videos)\\
-in front of asynchronous independent tasks students are assigned
 
#+end_quote


#+begin_src emacs-lisp
;; -in front of course documents\\
;; -in front of assessments\\
;; in front of core texts\\
;; -in front of handouts that require activity\\
;; - in front of videos (recorded lessons or outside videos)\\
;; -in front of asynchronous independent tasks students are assigned


(defun org-lms-set-module (params)
  "Create a module from params"
  (interactive)
  (message "module params: %s" params)
  (let* ((canvasid (map-elt params "moduleid" nil 'equal))
         (org-html-checkbox-type 'unicode )
         (course (org-lms-get-keyword "ORG_LMS_COURSEID"))
         (assignment-params  `(("module" . ,params)))
         (response
          (org-lms-canvas-request (format "courses/%s/modules%s"
                                          course
                                          (if canvasid
                                              (format  "/%s" canvasid) ""))
                                  (if canvasid "PUT" "POST")
                                  assignment-params))
         (response-data (or response nil)))
    (if response-data
    (browse-url (format "%s/courses/%s/modules#%s"
                        org-lms-public-baseurl course
                        (plist-get response-data :id) )))
    response))

(defun org-lms-module-delete (id)
  "Delete the given module from canvas (careful!)"
  (org-lms-canvas-request (format "courses/%s/modules/%s"
                                  (org-lms-get-keyword "ORG_LMS_COURSEID")
                                  id
                                  )
                            "DELETE" 
                          )
  )
;; just acopy of assignment-grou-pfrom-headline.  oos!
(defun org-lms-module-from-headline ()
  "Create a Module from HEADLINE.
  HEADLINE is an org-element object."
  (interactive)
  (let* ((name  (nth 4 (org-heading-components)) )
         (position (org-entry-get nil "POSITION"))
         (moduleid (or (org-entry-get nil "MODULE_ID")
                       (and (org-entry-get nil "MODULE")
                            (org-lms-map-module-from-name (org-entry-get nil "MODULE")))))
         (published (org-entry-get nil "PUBLISHED"))
         (params `(("name" . ,name))))
    (when position (add-to-list  'params `("position" .  ,position)))
    (when moduleid (add-to-list  'params `("moduleid" .  ,moduleid)))
    (when published (add-to-list  'params `("published" .  ,published)))
        (let* ((response (org-lms-set-module params))
           (response-data (or response nil)))
      (if (plist-get response-data :id)
          (progn
            (message "received module response-data %s" response-data)
            (org-set-property "MODULE_ID" (format "%s"(plist-get response-data :id)))
            (org-set-property "MODULE" (format "%s"(plist-get response-data :name)))
            (org-set-property "PUBLISHED" (format "%s"(plist-get response-data :published)))
            (org-set-property "POSITION" (format "%s"(plist-get response-data :position)))
            
            )
        (message "did not receive module group response-data"))
      response)
    ;; (message "Please ensure that MODULE and MODULE_ITEM_TYPE are both set")
    ))


(defun org-lms-match-emoji (category)
  (string= (downcase category)
           (downcase (org-property-get nil "ORG_LMS_CATEGORY"))
           ))



(defcustom org-lms-emojify t
  "whether or not to insert emoji in module item titles")


(defun org-lms-set-module-item (item module &optional canvasid)
  "create a module item from an item definition, then open modules page at item modules"
  (let* ((params `(("module_item" . ,item )))
         (course (org-lms-get-keyword "ORG_LMS_COURSEID"))
         response)
    (message "MODULEPARAMS: %s" item)
    (message "MODULEJSON: %s" (json-encode item))
    
    (setq response
     (org-lms-canvas-request (format "courses/%s/modules/%s/items%s"
                                     course
                                     module
                                     (if canvasid
                                         (format  "/%s" canvasid) ""))
       (if canvasid "PUT" "POST")
       params))
    
    ;; this opens at the *module*. Would it be better to link directly to the 
    ;; item itself at e.g. context_module_item_MODULEITEMID?
    ;; in which case replace 'module' with
    ;; (format "context_module_item_%s" (plist-get response-data :id)
    (browse-url (format "%s/courses/%s/modules#%s" org-lms-public-baseurl course module ))

    (or  response (request-response-error-thrown response) "Something's wrong")
    ))

(defcustom org-lms-emoji-alist
  '(("Assignment" . "")
    ("Coursedoc" . "")
    ("Reading" . "")
    ("Task" . "" )
    ("Quiz" . "" )
    ("Discussion" . "")
    ("Video" . "")
    ("Urgent" . ""))
  "Assoc between emoji and predicates")


(defun org-lms-module-item-from-headline ()
  "Extract module data from HEADLINE.
  HEADLINE is an org-element object."
  (interactive)
  (let* ((canvasid (org-entry-get nil "CANVASID"))
         (cat (or  (org-entry-get nil "ORG_LMS_CATEGORY" t)
                   (org-entry-get nil "MODULE_ITEM_TYPE" t)))
         (emoji (when (and  org-lms-emojify cat)
                  (concat  (alist-get cat  org-lms-emoji-alist  nil  nil 'string=) " ")))
         (name  (concat emoji  (nth 4 (org-heading-components))) )
         (position (org-entry-get nil "MODULE_POSITION"))
         (moduleid (or (org-entry-get nil "MODULE_ID" t)
                       (org-lms-map-module-from-name (org-entry-get nil "MODULE" t))))
         (moduleitemtype (or
                          (org-entry-get nil "MODULE_ITEM_TYPE" t)
                          (let ((assignmentp  (org-entry-get nil "CANVAS_SUBMISSION_URL"))
                                (pagep (org-entry-get nil "CANVAS_PAGE_URL") ))
                            (cond (assignmentp "Assignment")
                                  (pagep "Page")))))
         (moduleitemid (org-entry-get nil "MODULE_ITEM_ID"))
         (externalurl (org-entry-get nil "MODULE_ITEM_EXTERNAL_URL"))
         (pageurl (org-entry-get nil "CANVAS_PAGE_URL"))
         (content_id (or 
                      (org-entry-get nil "CANVAS_ID")
                      (org-entry-get nil "CONTENT_ID"))) ;; a bit risky keeping thesethe same
         (newtab t)
         (published  (org-entry-get nil "MODULE_ITEM_PUBLISHED") )
         ;; rules...
         (params `(("title" . ,name)
                   ("type" . ,moduleitemtype)
                   ("new_tab" . t)
                   ("published" . ,published))))
    (when canvasid (add-to-list 'params  `("content_id" . ,(string-to-number canvasid))))
    (when position (add-to-list  'params `("position" .  ,position)))
    (when pageurl (add-to-list  'params `("page_url" .  ,pageurl)))
    (when externalurl (add-to-list  'params `("external_url" .  ,externalurl)))
    ;; (when newtab (add-to-list  'params `("new_tab" .  ,newtab)))
    (when moduleitemid (add-to-list 'params `("module_item_id" . ,moduleitemid)))
    (if (and moduleid (or moduleitemtype pageurl ))
        (let* ((response (org-lms-set-module-item params moduleid moduleitemid))
               (response-data (or response nil))
               (html_url (plist-get response-data :html_url))
               (external_url (plist-get response-data :external_url)))
          
          (if (plist-get response-data :id)
              (progn
                (message "received module response-data")
                (org-set-property "MODULE_ITEM_ID" (format "%s"(plist-get response-data :id)))
                (org-set-property "MODULE_POSITION" (format "%s"(plist-get response-data :position)))

                ;; actually this doesn't get sent back for some reason? huh
                ;;(org-set-property "MODULE_ITEM_NEW_TAB" (format "%s"(plist-get response-data :new_tab)))
                ;; ditto here
                (org-set-property "CONTENT_ID" (format "%s"(or (plist-get response-data :content_id) canvasid "") ))
                (org-set-property "MODULE_ITEM_PUBLISHED" (format "%s"(plist-get response-data :published)))
                )
            (message "did not receive module item response-data"))
          response)
      (message "Please ensure that MODULE and MODULE_ITEM_TYPE are both set"))))
#+end_src

#+RESULTS:
: org-lms-module-item-from-headline

** Assignments, Submissions, and Attachments
Assignments first.  
- org-lms-get-assignments :: getter for all assignments in a course
- org-lms-merge-assignment-values :: transformer to merge local and LMS definitions of an assignment
-  ::
*** Getters
**** Assignments 
#+begin_src emacs-lisp
(defun org-lms-get-assignments (&optional courseid)
  (unless courseid
    (setq courseid (org-lms-get-keyword "ORG_LMS_COURSEID")))

  (org-lms-canvas-request (format "courses/%s/assignments" courseid) "GET"))

(defun org-lms-get-single-assignment (assignmentid &optional courseid)
  (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
  (org-lms-canvas-request (format "courses/%s/assignments/%s" courseid assignmentid) "GET"))



(defun org-lms-merge-assignment-values (&optional local canvas)
  (unless local
    (setq local org-lms-local-assignments ))
  (unless canvas
    (setq canvas (org-lms-get-assignments)))
  (message "LOCALLLLL")
  ;; (prin1 local)
  ;; (prin1 canvas)
  (let ((result '()))
    (cl-loop for l in-ref local
          do (let* ((defn (cdr l))
                    (name (plist-get defn :name)))
               (message "LLLLLLLLL")
               ;; (prin1 l)
               ;; (prin1 (plist-get (cdr l) :name))
               ;; (prin1 name)
               (dolist (c canvas)
                 (message "CCCCCCCC")
                 ;;(message "Printing canvas defn of %s" (plist-get c :name))
                 ;;(prin1 c)
                 (if (equal
                      name  (plist-get c :name))
                     (progn
                       (message "MADE ITI N")
                       (plist-put defn :canvasid (plist-get c :id))
                       (plist-put defn :html_url (plist-get c :html_url))
                       (plist-put defn :submissions_download_url (plist-get c :submissions_download_url))
                       (message "DEFN")
                       (prin1 defn)

                       (add-to-list 'result `(,(car l) .  ,defn)))))))
    result))
#+end_src

#+RESULTS:
: org-lms-merge-assignment-values
**** Submissions
Submissions
- org-lms-get-submissions: 
#+begin_src emacs-lisp
  (defun org-lms-get-submissions (&optional courseid)
    "get all submisisons in a COURSE (rarely used)."
    (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
    (org-lms-canvas-request (format "courses/%s/students/submissions" courseid) "GET"))

  (defun org-lms-get-assignment-submissions ( assignmentid &optional courseid)
    "Get all submisisons belonging to ASSIGNMENTID in optional COURSE."
  
    (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
    (org-lms-canvas-request
     (format "courses/%s/assignments/%s/submissions/" courseid assignmentid ) "GET"))

  (defun org-lms-get-single-submission (studentid assignmentid &optional courseid)
    "Retrieve a single sugmission from canvas.
  STUDENTID identifies the student, ASSIGNMENTID the assignment, and COURSEID the course."
    (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID") (plist-get org-lms-course)))
    (org-lms-canvas-request
     (format "courses/%s/assignments/%s/submissions/%s" courseid assignmentid studentid) "GET"))
#+end_src
