org-lms.org
**** Attachments
Attachments. These functions are a little complicated because attachments are stored on AWS and there's a 3-step process for getting them. The PUTTER is a little easier. 
#+begin_src emacs-lisp
(defun org-lms-get-canvas-attachments ()
  (interactive) 
  (let* ((assid
          (save-excursion 
            (org-up-heading-safe)
            (org-entry-get (point) "ASSIGNMENTID")
            ))
         (studentid (or (org-entry-get (point) "STUDENTID") (org-entry-get (point) "ID")))
         (submission (org-lms-get-single-submission studentid assid))
         (student (org-lms-find-local-user studentid))
         )
         (message "Submission: %s" submission)
    (cl-loop for attachment in (plist-get submission :attachments)
             do
             (message "%s%s"(downcase (plist-get student :lastname))
                      (downcase (plist-get student :firstname)) )
             (let* ((downloadurl (plist-get attachment :url))
                    (filename
                     (format "%s%s_%s%s_%s_%s"
                             (downcase (plist-get student :lastname))
                             (downcase (plist-get student :firstname))
                             (if (plist-get submission :late)
                                 "late_" "")
                             studentid   (org-lms-safe-pget attachment :studentid)
                             (plist-get attachment :display_name)))
                    (f (request-response-data
                        (request
                         downloadurl
                                :sync t
                         :parser 'buffer-string )))
                    (fullpath (expand-file-name filename (org-entry-get (point) "ORG_LMS_ASSIGNMENT_DIRECTORY"))))
               (message "attachment exists")
               ;;(prin1 f)
               ;;(message "STUDENT %s" (or (plist-get attachment :late) "NOPE"))
               (if (file-exists-p fullpath)
                   (message "file %s already exists, not downloading" filename)
               (let ((coding-system-for-write 'no-conversion))
                   (with-temp-file fullpath
                   ;; (set-buffer-multibyte nil)
                     (insert (string-as-multibyte f))
                     ;; (encode-coding-string contents 'utf-8 nil (current-buffer))
                     )))
               (unwind-protect
                   (condition-case err
                       (org-attach-attach (expand-file-name
                                           filename
                                           (org-entry-get
                                            (point) "ORG_LMS_ASSIGNMENT_DIRECTORY")))
                     ('error (message "Caught exception while attaching %s: [%s]"filename err)))
                 (message "Cleaning up attach...")))))
  )

#+end_src

#+RESULTS:
: org-lms-get-canvas-attachments
**** Assignment Groups
Just getting started with this. The idea is mostly to enable adding assignments to assignment groups.  The UI for this is a bit tricky to automate I think. Need to store these assignmetn groups locally osmehow I think. 
#+begin_src emacs-lisp
(defun org-lms-get-assignment-groups (&optional courseid)
  (unless courseid
    (setq courseid (org-lms-get-keyword "ORG_LMS_COURSEID")))

  (org-lms-canvas-request (format "courses/%s/assignment_groups" courseid) "GET"))

(defun org-lms-get-single-assignment-group (groupid &optional courseid)
  (setq courseid (or courseid (org-lms-get-keyword "ORG_LMS_COURSEID")
                     ))
  (org-lms-canvas-request (format "courses/%s/assignment_groups/%s" courseid groupid) "GET"))
#+end_src

*** ACTION Setters -- Creating Assignments
+*rename -parse-assignment to -post-assignment*+ DONE  

Functions to create announcements and assignments. Actually the crucial assignment code is still languishing in ~grading-template.org~. That's one of the reasons I made this org file - -to try to avoid that kind of junk!

