org-lms.org
**** Assignments
#+begin_src emacs-lisp 
(defun org-lms-post-assignment ()
  "Extract assignment data from HEADLINE.
  HEADLINE is an org-element object."
  (interactive)

  (let* ((canvasid (org-entry-get nil "CANVASID"))
         (duedate (org-entry-get nil "DUE_AT"))
         (org-html-checkbox-type 'unicode )  ;; canvas stirps checkbox inputs
         (pointspossible (if (org-entry-get nil "ASSIGNMENT_WEIGHT") (* 100 (string-to-number (org-entry-get nil "ASSIGNMENT_WEIGHT")))))
         (gradingtype (or  (org-entry-get nil "GRADING_TYPE") "letter_grade"))
         (subtype (or (and (org-entry-get nil "CANVAS_SUBMISSION_TYPES")
                           (replace-regexp-in-string "(\\([^()]*\\))" "\\1"
                                                     (org-entry-get nil "CANVAS_SUBMISSION_TYPES")  ))
                      (if (equal (org-entry-get nil "ASSIGNMENT_TYPE")
                                 "canvas")
                          "online_upload" "none")))
         ;;  (org-entry-get nil "DUE_AT"))
         (publish (org-entry-get nil "OL_PUBLISH"))
         (group (org-entry-get nil "ASSIGNMENT_GROUP" t))
         (omit (org-entry-get nil "ASSIGNMENT_OMIT"))
         (position (org-entry-get nil "ASSIGNMENT_POSITION"))
         (reflection (org-entry-get nil "OL_HAS_REFLECTION"))
         (reflection-id (org-entry-get nil "OL_REFLECTION_ID"))
         (org-export-with-tags nil)
         (assignment-params `(("name" .  ,(nth 4 (org-heading-components)) )
                              ("description" . ,(org-export-as 'html t nil t))
                              ("due_at" . ,(o-l-date-to-timestamp
                                            (or duedate
                                                (format-time-string "%Y-%m-%d"
                                                                    (time-add (current-time) (* 7 24 3600) )) ) ))
                              ;;`("due_at"   . ,(o-l-date-to-timestamp duedate))
                              
                              ("submission_types" . ,subtype)
                              ("grading_type" . ,gradingtype)
                              ("grading_standard_idcomment" . 458)
                              ("points_possible" . ,(or pointspossible 10))
                              ("published" . ,(if publish t nil) )
                              
                              ))
         response finalparams)
    ;; (message "canvas evals to %s" (if canvasid "SOMETHING " "NOTHING" ))
    ;;(prin1 canvasid)
    (when group
      (add-to-list 'assignment-params `("assignment_group_id" . ,(org-lms-map-assignment-group-from-name group))))
    (when position
      (add-to-list  'assignment-params `("position" . ,position)))
    (when omit
      (add-to-list 'assignment-params `("omit_from_final_grade" ,
                                        omit)))
    (setq finalparams `(("assignment" .  ,assignment-params)))
    (setq response
          (org-lms-canvas-request (format "courses/%s/assignments%s"
                                          (org-lms-get-keyword "ORG_LMS_COURSEID");; (plist-get org-lms-course :id)
                                          (if canvasid
                                              (format  "/%s" canvasid) "")
                                          )
            (if canvasid "PUT" "POST")
            finalparams
            ))
    (setq response-data (or response nil))
    (message "response data is non-nil %s" response-data)
          ;; (message "HERE COMES THE PARAMS %s" (request-response-data response) )
          ;; (prin1 (assq-delete-all "assignment[description]" assignment-params))



    (if (plist-get response-data :id)
        (progn
          (message "received assignment response-data")
          (org-set-property "DUE_AT"  (format "%s" (substring
                                                    (plist-get response-data :due_at)
                                                    0 10)))
          (org-set-property "CANVASID" (format "%s"(plist-get response-data :id)))
          (org-set-property "OL_PUBLISH" (format "%s"(plist-get response-data :published)))
          (org-set-property "ORG_LMS_CATEGORY" "Assignment")
          (org-set-property "CANVAS_HTML_URL" (format "%s"(plist-get response-data :html_url)))
          (org-set-property "CANVAS_SUBMISSION_URL" (format "%s" (plist-get response-data :submissions_download_url)))
          (org-set-property "SUBMISSIONS_DOWNLOAD_URL" (format "%s"(plist-get response-data :submissions_download_url)))
          (org-set-property "GRADING_STANDARD_ID" (format "%s"(plist-get response-data :grading_standard_id)))
          (org-set-property "CANVAS_SUBMISSION_TYPES" (format "%s"(plist-get response-data :submission_types)))
          (org-set-property "GRADING_TYPE" (format "%s"(plist-get response-data :grading_type)))
          (org-set-property "CANVASID" (format "%s"(plist-get response-data :id)))
          
          (if reflection 
              (let* ((reflection-params `(("assignment" .
                                           (("name" .  ,(concat  (nth 4 (org-heading-components)) " Reflection Questions") )
                                            ("description" . ,(org-export-as 'html t nil t))
                                            ,(if duedate
                                                 `("due_at"   . ,(o-l-date-to-timestamp duedate))
                                               )
                                            ("submission_types" . "none")
                                            ("grading_type" . ,gradingtype)
                                            ("grading_standard_idcomment" . 458)
                                            ("points_possible" . 1)
                                            ("published" . ,(if publish t nil) )))))
                     (reflection-response
                      (org-lms-canvas-request (format "courses/%s/assignments%s"
                                                      (org-lms-get-keyword "ORG_LMS_COURSEID")
                                                      (if reflection-id
                                                          (format  "/%s" reflection-id) "")
                                                      )
                        (if reflection-id "PUT" "POST")
                        assignment-params
                        )))
                (if (and reflection-response (plist-get reflection-response :id))
                    (progn
                      (message "received reflection response-data")
                      (org-set-property "OL_REFLECTION_ID" (format "%s" (plist-get response-data :id)))))))))

    response))



(defun org-lms-post-assignment-and-save (&optional file)
  "First post the assignment, then save the value to FILE."
  (interactive)
  (unless file (setq file (expand-file-name "assignments.el")))
  (org-lms-post-assignment)
  (org-lms-save-assignment-map file))
#+end_src

#+RESULTS:
: org-lms-post-assignment-and-save

Adding these functions to update all assignments for the new year.  But actually just need to somehow update the ids -- this isn't really all that helpful acttually. Ended up going through by hand.  
#+begin_src emacs-lisp
(defun org-lms-assignment-update ()
  "remove previous year's properties to make updating easier."
  (interactive)
  (cl-map 'list  (lambda (prop)
                   (org-entry-delete (point) prop))
          '("CANVASID" "CANVAS_HTML_URL" "CANVAS_SUBMISSION_URL" "SUBMISSIONS_DOWNLOAD_URL"))
  )

(defun org-lms-assignment-update-all ()
  (interactive)
  (org-map-entries #'org-lms-assignment-update "assignment"))
#+end_src

#+RESULTS:
: org-lms-assignment-update-all

