org-lms.el
         (duedate (org-entry-get nil "DUE_AT"))
         (org-html-checkbox-type 'unicode )  ;; canvas stirps checkbox inputs
         (pointspossible (if (org-entry-get nil "ASSIGNMENT_WEIGHT") (* 100 (string-to-number (org-entry-get nil "ASSIGNMENT_WEIGHT")))))
         (gradingtype (or  (org-entry-get nil "GRADING_TYPE") "letter_grade"))
         (subtype (if (equal (org-entry-get nil "ASSIGNMENT_TYPE") "canvas") "online_upload" "none"))
         ;;( (org-entry-get nil "DUE_AT"))
         (publish (org-entry-get nil "OL_PUBLISH"))
         (reflection (org-entry-get nil "OL_HAS_REFLECTION"))
         (reflection-id (org-entry-get nil "OL_REFLECTION_ID")))
    ;; (message "canvas evals to %s" (if canvasid "SOMETHING " "NOTHING" ))
    ;;(prin1 canvasid)
    (let* ((org-export-with-tags nil)
           (assignment-params `(("assignment" .
                                 (("name" .  ,(nth 4 (org-heading-components)) )
                                  ("description" . ,(org-export-as 'html t nil t))
                                  ,(if duedate
                                       ;;`("due_at"   . ,(concat duedate  "T23:59:59-04:00"))
                                       `("due_at"   . ,(o-l-date-to-timestamp duedate))
                                     )
                                  ("submission_types" . ,subtype)
                                  ("grading_type" . ,gradingtype)
                                  ("grading_standard_idcomment" . 458)
                                  ("points_possible" . ,(or pointspossible 10))
                                  ("published" . ,(if publish t nil) )))))

           (response
            (org-lms-canvas-request (format "courses/%s/assignments%s"
                                            (org-lms-get-keyword "ORG_LMS_COURSEID");; (plist-get org-lms-course :id)
                                            (if canvasid
                                                (format  "/%s" canvasid) "")
                                            )
                                    (if canvasid "PUT" "POST")
                                    assignment-params
                                    ))
           (response-data (or response nil))
           )
      ;; (message "HERE COMES THE PARAMS %s" (request-response-data response) )
      ;; (prin1 (assq-delete-all "assignment[description]" assignment-params))
      (if (plist-get response-data :id)
          (progn
            (message "received assignment response-data")
            (org-set-property "CANVASID" (format "%s"(plist-get response-data :id)))
            (org-set-property "OL_PUBLISH" (format "%s"(plist-get response-data :published)))
            (org-set-property "CANVAS_HTML_URL" (format "%s"(plist-get response-data :html_url)))
            (org-set-property "CANVAS_SUBMISSION_URL" (format "%s" (plist-get response-data :submissions_download_url)))
            (org-set-property "SUBMISSIONS_DOWNLOAD_URL" (format "%s"(plist-get response-data :submissions_download_url)))
            (org-set-property "GRADING_STANDARD_ID" (format "%s"(plist-get response-data :grading_standard_id)))
            (org-set-property "CANVAS_SUBMISSION_TYPES" (format "%s"(plist-get response-data :submission_types)))
            (org-set-property "GRADING_TYPE" (format "%s"(plist-get response-data :grading_type)))
            (org-set-property "CANVASID" (format "%s"(plist-get response-data :id)))
            (if reflection 
                (let* ((reflection-params `(("assignment" .
                                             (("name" .  ,(concat  (nth 4 (org-heading-components)) " Reflection Questions") )
                                              ("description" . ,(org-export-as 'html t nil t))
                                              ,(if duedate
                                                   ;;`("due_at"   . ,(concat duedate  "T23:59:59-04:00"))
                                                   `("due_at"   . ,(o-l-date-to-timestamp duedate))
                                                 )
                                              ("submission_types" . "none")
                                              ("grading_type" . ,gradingtype)
                                              ("grading_standard_idcomment" . 458)
                                              ("points_possible" . 1)
                                              ("published" . ,(if publish t nil) )))))
                       (reflection-response
                        (org-lms-canvas-request (format "courses/%s/assignments%s"
                                                        (org-lms-get-keyword "ORG_LMS_COURSEID")
                                                        (if reflection-id
                                                            (format  "/%s" reflection-id) "")
                                                        )
                                                (if reflection-id "PUT" "POST")
                                                assignment-params
                                                )))
                  (if (and reflection-response (plist-get reflection-response :id))
                      (progn
                        (message "received reflection response-data")
                        (org-set-property "OL_REFLECTION_ID" (format "%s" (plist-get response-data :id)))))))
            
            
            ))

      
      ;; (message "ASSIGNMENT_TYPE is canvas %s" (equal "canvas" (org-entry-get nil "ASSIGNMENT_TYPE")))
      ;; (message "RESPONSE IS %s" response)
      response)))



(defun org-lms-post-assignment-and-save (&optional file)
  "First post the assignment, then save the value to FILE."
  (interactive)
  (unless file (setq file (expand-file-name "assignments.el")))
  (org-lms-parse-assignment)
  (org-lms-save-assignment-map file))
