org-lms.org
**** Assignment Groups
#+begin_src emacs-lisp
(defun org-lms-assignment-group-from-headline ()
  "Extract assignment group data from HEADLINE.
  HEADLINE is an org-element object."
  (interactive)
  (let* ((canvasid (org-entry-get nil "GROUP_ID"))
         (name  (nth 4 (org-heading-components)) )
         (position (org-entry-get nil "GROUP_POSITION"))
         (weight (org-entry-get nil "GROUP_WEIGHT"))
         ;; rules...

         (params `((name . ,name)
                   )))
         (when position (add-to-list 'params `("position" ,(string-to-number position))))
         (when weight (plist-put params `("group_weight" ,(string-to-number weight))))

    (let* ((response (org-lms-set-assignment-group params))
           (response-data (or response nil)))
      
      (if (plist-get response-data :id)
          (progn
            (message "received assignment group response-data")
            (org-set-property "GROUP_ID" (format "%s"(plist-get response-data :id)))
            (org-set-property "GROUP_POSITION" (format "%s"(plist-get response-data :position)))
            (org-set-property "GROUP_WEIGHT" (format "%s"(plist-get response-data :group_weight)))
            )
        (message "did not receive assignment group response-data"))
      response)))

(defun org-lms-set-assignment-group (params)
  "Create an asignment group from params"
  (interactive)

  (let* ((canvasid (plist-get params  "CANVASID"))
         (org-html-checkbox-type 'unicode )  ;; canvas stirps checkbox inputs
         (pointspossible (if (org-entry-get nil "ASSIGNMENT_WEIGHT") (* 100 (string-to-number (org-entry-get nil "ASSIGNMENT_WEIGHT")))))
         )
    ;; (message "canvas evals to %s" (if canvasid "SOMETHING " "NOTHING" ))
    ;;(prin1 canvasid)
    (let* ((org-export-with-tags nil)
           (assignment-params  params 
                               )
           

           (response
            (org-lms-canvas-request (format "courses/%s/assignment_groups%s"
                                            (org-lms-get-keyword "ORG_LMS_COURSEID")
                                            (if canvasid
                                                (format  "/%s" canvasid) "")
                                            )
                                    (if canvasid "PUT" "POST")
                                    assignment-params
                                    ))
           (response-data (or response nil)))
      response)))
#+end_src

#+RESULTS:
: org-lms-set-assignment-group

also a utility for adding a group if needed
#+begin_src emacs-lisp
(defun org-lms-map-assignment-group-from-name (name)
  (interactive)
  (let* ((groups (org-lms-get-assignment-groups))
         (match (or (--first (string= (plist-get it :name) name) groups )
                    (org-lms-set-assignment-group `((name . ,name)))))
         )
    (plist-get match :id) ;;(plist-get it :id)
    ;;(org-lms-set-assignment-group `((name . ,name))))
    ))


;;(org-lms-set-assignment-group `((name . "Tests")))
#+end_src


** ACTION Calendar Events
Right now I have no way to generate calendar events & therefore put stuff into the "upcoming events' stream in Canvas.  [[https://canvas.instructure.com/doc/api/calendar_events.html][The API for Calendar Events is described here]]. It won't be easy for me to accommodate this mode of organization, unfortunately.  Probably won't happen for a while.

Here is some info form the web:


**** [[https://canvas.instructure.com/doc/api/calendar_events.html#method.calendar_events_api.set_course_timetable][Set a course timetable]] [[https://github.com/instructure/canvas-lms/blob/master/app/controllers/calendar_events_api_controller.rb][CalendarEventsApiController#set_course_timetable]]
   
***** POST /api/v1/courses/:course_id/calendar_events/timetable
 *Scope:* =url:POST|/api/v1/courses/:course_id/calendar_events/timetable=

Creates and updates timetable events for a course. Can automaticaly generate a series of calendar events based on simple schedules (e.g. Monday and Wednesday at 2:00pm )

Existing timetable events for the course and course sections will be updated if they still are part of the timetable. Otherwise, they will be deleted.

****** Request Parameters:
timetables[course_section_id][] 		Array 	

An array of timetable objects for the course section specified by course_section_id. If course_section_id is set to all, events will be created for the entire course.
timetables[course_section_id][][weekdays] 		string 	

A comma-separated list of abbreviated weekdays (Mon-Monday, Tue-Tuesday, Wed-Wednesday, Thu-Thursday, Fri-Friday, Sat-Saturday, Sun-Sunday)
timetables[course_section_id][][start_time] 		string 	

Time to start each event at (e.g. 9:00 am)
timetables[course_section_id][][end_time] 		string 	

Time to end each event at (e.g. 9:00 am)
timetables[course_section_id][][location_name] 		string 	

A location name to set for each event
#+end_quote 
*** Getters -- not implemented
*** Setters -- not implemented
ok, let's start with a very simple basic function modled on modules
*BLA*. This really sucks actually. It doesn't seem very useful.
#+begin_src emacs-lisp :tangle no
(defun org-lms-set-timetable (params)
  "Create a timetable from params"
  (interactive)
  (message "timetable params: %s" params)
  (let* ((canvasid (map-elt params "timetableid" nil 'equal))
         (org-html-checkbox-type 'unicode )
         (event-params  `(("course_id" . ,(org-lms-get-keyword "ORG_LMS_COURSEID"))
                          ("events" . (,params))))
         (response
          (org-lms-canvas-request
           (format "courses/%s/calendar_events/timetable_events"
                   (org-lms-get-keyword "ORG_LMS_COURSEID")
                   (if canvasid
                       (format  "/%s" canvasid) ""))
           (if canvasid "PUT" "POST")
           evebt-params))
         (response-data (or response nil)))
    response))
#+end_src
** ACTION Announcements
*** ACTION Setters -- headlineto announcement
todo: docstrings!!; also, need to switch to CANVASID from ORG_LMS_ANNOUNCEMENT_ID for consistency, in order to use ~org-lms-propertize-thingie~. 

Also, looks like it isn't reading heading properties before posting!! Needs to be rewritten on model of other setters.
#+begin_src emacs-lisp
  ;; huh is this deprecated?
  ;; doesn't seem to be used at all 
(defun org-lms-post-announcement (payload &optional courseid)
  "Create new announcement using PAYLOAD a data in course COURSEID."
    (setq courseid (or courseid
                       (org-lms-get-keyword "ORG_LMS_COURSEID")
                       (plist-get org-lms-course)))
    (org-lms-canvas-request
     (format "courses/%s/discussion_topics" courseid) "POST" payload))

;; announcements

(defun org-lms-headline-to-announcement (&optional courseid file)
  ""
  (interactive)
  (setq courseid (or courseid
                       (org-lms-get-keyword "ORG_LMS_COURSEID")
                       (plist-get org-lms-course)))
  ;; (cl-flet ((org-html--build-meta-info
  ;;            (lambda (&rest args) ""))))
  (let* ((org-export-with-toc nil)
         (org-export-with-smart-quotes nil)
         (org-html-postamble nil)
         (org-html-preamble nil)
         (org-html-xml-declaration nil)
         (org-html-head-include-scripts nil)
         (org-html-head-include-default-style nil)
         ;;(atext (org-export-as 'html t))
         (atitle (nth 4 (org-heading-components)))
         (org-html-klipsify-src nil)
         (org-export-with-title nil)
         ;;(courseid (plist-get course :id))
         (atext (org-export-as 'canvas-html t nil t))
         (response nil)
         (oldid (org-entry-get (point) "ORG_LMS_ANNOUNCEMENT_ID"))
         )
    ;; (message "BUILDMETA DEFN")
    ;; (prin1 (symbol-function  'org-html--build-meta-info))
    ;; (message "%s" atext)
    (if oldid
        (progn
          (message "already added!")
          (setq response ;;(request-response-data) 
                (org-lms-canvas-request
                 (format  "courses/%s/discussion_topics/%s" courseid oldid) "PUT"
                 `(("title" . ,atitle)
                   ("message" . ,atext)
                   ("is_published" . t)
                   ("is_announcement" . t)))))

      (setq response ;;(request-response-data)
            (org-lms-canvas-request
             (format  "courses/%s/discussion_topics" courseid) "POST"
             `(("title" . ,atitle)
               ("message" . ,atext)
               ("is_published" . t)
               ("is_announcement" . t)))))
    (cl-loop for (k v) on response
             do
             (message "%s %S" k v))
    (org-entry-put (point) "ORG_LMS_ANNOUNCEMENT_ID" (format "%s" (plist-get response :id)))
    (org-entry-put (point) "ORG_LMS_ANNOUNCEMENT_URL" (format "%s" (plist-get response :url)))
    (org-entry-put (point) "ORG_LMS_POSTED_AT" (format "%s" (plist-get response :posted_at)))

    (if (plist-get response :url) 
        (browse-url (plist-get response :url)))
    response))



#+end_src

#+RESULTS:
: org-lms-headline-to-announcement


*** troubleshooting
#+begin_src emacs-lisp :tangle no

  ;;; Code:

  ;; something else


  (json-encode '(("assignment[description]" . "<p>\nThis kind of amazing-sounding talk is happenin...") ("assignment[submission_types]" . "none") ("assignment[grading_type]" . "letter_grade") ))


  (json-encode `(("assignment[description]" . "<p>\nThis kind of amazing-sounding talk is happenin...") ("assignment[submission_types]" . "none") ("assignment[grading_type]" . "letter_grade")(descrpition . "" ) (key1 . "value1") ,(if nil t '("" . ""))))


#+end_src

to#+RESULTS:
: {"assignment[description]":"<p>\nThis kind of amazing-sounding talk is happenin...","assignment[submission_types]":"none","assignment[grading_type]":"letter_grade","descrpition":"","key1":"value1","":""}
** Grading Standards
Unfortunately, at Canadian schools we need to set the grading standard for every single assignment :frowning:  TThis should be another keyword I guess :-(. However... once again I don't seem to have permission to set the grading standards fro mthe API :-(; and I can't evne seme to *get* them, which is frustrating.    
