org-lms.org
*** ACTION Set up local environment
Need to assess usefulness of all this. 

org-lms-setup especially is useful here; and "get-local-students" parses ~students.csv~ (kinda on its way to being deprecated eventually). 

*TODO*: Need to switch to JSON format for students!!

#+begin_src emacs-lisp
;;deprectaed!!!!!!
(defun org-lms-setup ()
  "Merge  defs and students lists, and create table for later use.

`org-lms-course', `org-lms-local-assignments' and other org-lms
variables must be set or errors wil lresult."
  (setq org-lms-merged-students (org-lms-merge-student-lists))
  (setq org-lms-merged-assignments (org-lms-merge-assignment-values))
  (org-lms-assignments-table org-lms-merged-assignments)
  )

(defun org-lms-setup-grading (&optional courseid assignmentsfile)
  "Parse assignments buffer and students lists, and create table for later use.

`org-lms-course', `org-lms-local-assignments' and other org-lms
variables must be set or errors will result."
  (setq org-lms-merged-students (org-lms-merge-student-lists))
  ;;(setq org-lms-merged-assignments (org-lms-merge-assignment-values))
  (setq assignments (org-lms-map-assignments (org-lms-get-keyword "ORG_LMS_ASSIGNMENTS")))
  (setq org-lms-merged-assignments assignments)
  (org-lms-assignments-table assignments)
  )
(defun org-lms-get-local-csv-students (&optional csv)
  (unless csv
    (setq csv "./students.csv"))
  (org-lms~parse-plist-symbol-csv-file csv)
  )

(defun org-lms-get-local-json-students (&optional jfile)
  (unless jfile
    (setq jfile "./students-local.json"))
  (ol-jsonwrapper json-read-file jfile))



(defcustom org-lms-get-student-function 'org-lms-get-local-json-students
  "function to use to get students"
  :type 'function)

(defun org-lms-get-local-students (&optional file)
  ;; (unless file
  ;;   (setq file "./students.json"))
  (apply org-lms-get-student-function (list file)))
#+end_src

#+RESULTS:
: org-lms-get-local-students

*** Assignments Table
This function prints out a helpful table with links to various locations (e.g., LMS URLs for assignments & submissions) and elisp functions (e.g., grading headline generation).
#+begin_src emacs-lisp
  (defun org-lms-assignments-table (&optional assignments students)
    "Return a 2-dimensional list suitable whose contents are org-mode table cells.

  Intnded to be used in a simpe src block with :results header `value raw table'. 
  Resultant links allow quick access to the canvas web interface as well as the make-headings commands."
    (unless assignments
      (setq assignments org-lms-merged-assignments))
    (unless students
      (setq students org-lms-merged-students))
    ;;(message "MERGED ASSIGNMENTS")
    ;;(prin1 assignments)
    (let* ((cid (org-lms-get-keyword "ORG_LMS_COURSEID"))
           (make-headlines-string "")
           (table-header '(("Name (upload here)" "Download URL" Inspect "Make Headers") hline))
           )
      (append '(("Name (upload here)" "Download URL" Inspect "Make Headers") hline)
              (cl-loop for i in assignments
                       collect `( ,(format "%s"
                                           (if (plist-get (cdr i) :html_url)
                                               (concat "[[" (org-lms-safe-pget (cdr i) :html_url) "][" (org-lms-safe-pget (cdr i) :name) "]]")
                                             (org-lms-safe-pget (cdr i) :name)) ) 
                                  ,(format "%s"
                                           (if (plist-get (cdr i) :submissions_download_url)
                                               (concat "[[" (org-lms-safe-pget (cdr i) :submissions_download_url) "][Download Submissions]]")
                                             " ")
                                           )
                                  ,(format
                                    "%s"
                                    (if (plist-get (cdr i) :canvasid)
                                        (concat  "[[elisp:(org-lms-canvas-inspect \"courses/"
                                                 (format "%s" cid)
                                                 "/assignments/"
                                                 (format "%s" (org-lms-safe-pget (cdr i) :canvasid))
                                                 "\")][Inspect Original JSON]]")
                                      " "))
                                  ;; "Inspect Original JSON"
                                  ,(format "[[%s][%s]]"
                                           (concat "elisp:(org-lms-make-headings (alist-get '"
                                                   (symbol-name (car i))
                                                   " org-lms-merged-assignments) org-lms-merged-students)"
                                                   ) 
                                           "Make Headlines"))))

      ))

#+end_src
#+RESULTS:
: org-lms-assignments-table

*** Making headings
