org-lms.el
  "Return a 2-dimensional list suitable whose contents are org-mode table cells.

Intnded to be used in a simpe src block with :results header `value raw table'. 
Resultant links allow quick access to the canvas web interface as well as the make-headings commands."
  (unless assignments
    (setq assignments org-lms-merged-assignments))
  (unless students
    (setq students org-lms-merged-students))
  ;;(message "MERGED ASSIGNMENTS")
  ;;(prin1 assignments)
  (let* ((cid (org-lms-get-keyword "ORG_LMS_COURSEID"))
         (make-headlines-string "")
         (table-header '(("Name (upload here)" "Download URL" Inspect "Make Headers") hline))
         )
    (append '(("Name (upload here)" "Download URL" Inspect "Make Headers") hline)
            (cl-loop for i in assignments
                     collect `( ,(format "%s"
                                         (if (plist-get (cdr i) :html_url)
                                             (concat "[[" (org-lms-safe-pget (cdr i) :html_url) "][" (org-lms-safe-pget (cdr i) :name) "]]")
                                           (org-lms-safe-pget (cdr i) :name)) ) 
                                ,(format "%s"
                                         (if (plist-get (cdr i) :submissions_download_url)
                                             (concat "[[" (org-lms-safe-pget (cdr i) :submissions_download_url) "][Download Submissions]]")
                                           " ")
                                         )
                                ,(format
                                  "%s"
                                  (if (plist-get (cdr i) :canvasid)
                                      (concat  "[[elisp:(org-lms-canvas-inspect \"courses/"
                                               (format "%s" cid)
                                               "/assignments/"
                                               (format "%s" (org-lms-safe-pget (cdr i) :canvasid))
                                               "\")][Inspect Original JSON]]")
                                    " "))
                                ;; "Inspect Original JSON"
                                ,(format "[[%s][%s]]"
                                         (concat "elisp:(org-lms-make-headings (alist-get '"
                                                 (symbol-name (car i))
                                                 " org-lms-merged-assignments) org-lms-merged-students)"
                                                 ) 
                                         "Make Headlines"))))

    ))
