org-lms.org
***** Attachments 

Make sure to get all the attachments.  I think that org-mime now takes care of this so it might be a good idea to refactor.  


#+begin_src emacs-lisp

;; stolen from gnorb, but renamed to avoid conflicts
(defun org-lms~attachment-list (&optional id)
  "Get a list of files (absolute filenames) attached to the
  current heading, or the heading indicated by optional argument ID."
  (when (featurep 'org-attach)
    (let* ((attach-dir (save-excursion
                         (when id
                (org-id-goto id))
                         (org-attach-dir t)))
           (files
            (mapcar
             (lambda (f)
               (expand-file-name f attach-dir))
             (org-attach-file-list attach-dir))))
      files)))

#+end_src

***** ACTION Sending Subtrees
Huh, interesting. I have two versions of this code and no idea which of them is actually used where!! +In fact, it kind of looks like neither is being used.  Source of much confusion!!+

*UPDATE <2018-11-08 Thu>:* ~org-mime-lms-send-subtree-with-attachments~ is an obsolete function which has been replaced by ~org-lms-mime-org-subtree-htmlize~.  I'm too chicken to delete it right now but should do so soon.

*UPDATE <2019-10-01 Tue>:* need to remove calls to ~mwp-org-get-parent-headline~, and also figure out if these are still used at all.  

#+begin_src emacs-lisp
;; temp fix for gh
(defun org-lms~mail-text-only ()
  "org-mime-subtree and HTMLize"
  (interactive)
  (org-mark-subtree)
  (save-excursion
    (org-mime-org-subtree-htmlize)
    (message-send-and-exit)
    )
  )

;; mail integration. Only tested with mu4e.
(defun org-lms~send-subtree-with-attachments ()
  "org-mime-subtree and HTMLize"
  (interactive)
  ;; (org-mark-subtree)
  (let ((attachments (org-lms~attachment-list)))
    (save-excursion
      (org-lms-mime-org-subtree-htmlize attachments))
    ))

;; defunkt
(defun org-lms-send-subtree-with-attachments ()
  "org-mime-subtree and HTMLize"
  (interactive)
  (org-mark-subtree)
  (let ((attachments (mwp-org-attachment-list))
        (subject  (mwp-org-get-parent-headline)))
    ;;(insert "Hello " (nth 4 org-heading-components) ",\n")
    (org-mime-subtree)
    (insert "\nBest,\nMP.\n")
    (message-goto-body)
    (insert "Hello,\n\nAttached are the comments from your assignment.\n\n")
    (insert "At this point I have marked all the papers I know about. If 
you have not received a grade for work that you have handed in,
 please contact me immediately and we can resolve the situation!.\n\n")
    ;; (message "subject is" )
    ;; (message subject)
    ;;(message-to)
    (org-mime-htmlize)
    ;; this comes from gnorb
    ;; I will reintroduce it if I want to reinstate questions.
    ;; (map-y-or-n-p
    ;;  ;; (lambda (a) (format "Attach %s to outgoing message? "
    ;;  ;;                    (file-name-nondirectory a)))
    ;; (lambda (a)
    ;;   (mml-attach-file a (mm-default-file-encoding a)
    ;;                    nil "attachment"))
    ;; attachments
    ;; '("file" "files" "attach"))
    ;; (message "Attachments: %s" attachments)
    (dolist (a attachments) (message "Attachment: %s" a) (mml-attach-file a (mm-default-file-encoding a) nil "attachment"))
    (message-goto-to)
    ))
#+end_src

#+RESULTS:
: org-lms-send-subtree-with-attachments

***** ACTION Mail and Post Multiple Trees

Once again, I've written multiple functions to do two very similar tasks. Need to refactor!!!

*UPDATE* Need to test the new code. Once that's done, can also test Canvas integration by simultaneously sending to canvas in ~org-lms-mail-all~ (which will have to be refactored).

#+begin_src emacs-lisp



(cl-defun org-lms-return-all-assignments (&optional (send-all nil) (also-mail nil) (post-to-lms t) )
  "By default mail all subtrees 'READY' to student recipients, unless SEND-ALL is non-nil.
In that case, send all marked 'READY' or 'TODO'."
  (interactive)
  (message "Returning all READY subtrees to students")
  
  (let* ((ol-status-org-msg org-msg-mode)
        
        (send-condition
         (if send-all
             `(or (string= (org-element-property :todo-keyword item) "READY")
                  (string= (org-element-property :todo-keyword item) "TODO") )
           `(string= (org-element-property :todo-keyword item) "READY")
           )))
    (if ol-status-org-msg (org-msg-mode))
    (org-map-entries 
     #'ol-return-just-one)
    (if ol-status-org-msg (org-msg-mode)))
  (org-cycle-hide-drawers 'all))


(cl-defun ol-return-just-one (&optional (also-mail nil) (post-to-lms t))
  ;; (print (nth 0 (org-element-property :todo-keyword item)))
  (interactive)
  (let ((also-mail (org-entry-get nil "ORG_LMS_EMAIL_COMMENTS" t))
        (post-to-lms (org-entry-get nil "ORG_LMS_CANVAS_COMMENTS" t)))
    
    (when (string= (nth 2 (org-heading-components) ) "READY")
      (when post-to-lms (org-lms-put-single-submission-from-headline))
      (when also-mail  (save-excursion
                         ;;(org-lms-mime-org-subtree-htmlize )
                         (org-lms~send-subtree-with-attachments)
                         (sleep-for 1)
                         ;; (message-send-and-exit)
                         ))
      (org-todo "SENT"))))
;; should get rid of this & just add a flag to ~org-lms-mail-all~
(defun org-lms-return-all-undone ()
  (interactive)
  "Mail all subtrees marked 'TODO' to student recipients."
  (org-element-map (org-element-parse-buffer) 'headline
    (lambda (item)
      ;; (print (nth 0 (org-element-property :todo-keyword item)))
      (when (string= (org-element-property :todo-keyword item) "TODO")
        (save-excursion
          (goto-char (1+ (org-element-property :begin item)) )
          ;;(print "sending")
          ;;(print item)
          (save-excursion
            (org-lms-send-missing-subtree)
            (message-send-and-exit))
          (org-todo ))))))

(cl-defun org-lms-post-all-grades (&optional (send-all nil) (also-mail nil) (post-to-lms t) )
  "By default post all  'READY' to student recipients, unless SEND-ALL is non-nil.
In that case, send all marked 'READY' or 'TODO'."
  (interactive)
  (message "Returning all READY subtrees to students")
  
  (let* ((ol-status-org-msg org-msg-mode)
         
         (send-condition
          (if send-all
              `(or (string= (org-element-property :todo-keyword item) "READY")
                   (string= (org-element-property :todo-keyword item) "TODO") )
            `(string= (org-element-property :todo-keyword item) "READY")
            )))
    (org-map-entries 
     #'ol-post-just-one-grade))
  (org-cycle-hide-drawers 'all))

(cl-defun ol-post-just-one-grade ()
  "post only the grade for current headline"
  (interactive)
  (when (string= (nth 2 (org-heading-components) ) "READY")
    (org-lms-put-single-grade-from-headline)
    (org-todo "SENT")))

;; doesn't seem to actually be used... 
(defun org-lms-send-missing-subtree ()
  "org-mime-subtree and HTMLize"
  (interactive)
  (org-mark-subtree)
  (let ((attachments (mwp-org-attachment-list))
        (subject  (mwp-org-get-parent-headline)))
    ;;(insert "Hello " (nth 4 org-heading-components) ",\n")
    (org-mime-subtree)
    (insert "\nBest,\nMP.\n")
    (message-goto-body)
    (insert "Hello,\n\nI have not received a paper from you, and ma sending this email just to let you know.\n\n")
    (insert "At this point I have marked all the papers I know about. If 
you have not received a grade for work that you have handed in,
 please contact me immediately and we can resolve the situation!.\n\n")
    (org-mime-htmlize)
    ;; this comes from gnorb
    ;; I will reintroduce it if I want to reinstate questions.
    ;; (map-y-or-n-p
    ;;  ;; (lambda (a) (format "Attach %s to outgoing message? "
    ;;  ;;                    (file-name-nondirectory a)))
    ;; (lambda (a)
    ;;   (mml-attach-file a (mm-default-file-encoding a)
    ;;                    nil "attachment"))
    ;; attachments
    ;; '("file" "files" "attach"))
    ;; (message "Attachments: %s" attachments)
    (dolist (a attachments) (message "Attachment: %s" a) (mml-attach-file a (mm-default-file-encoding a) nil "attachment"))
    (message-goto-to)
    ))


#+end_src

#+RESULTS:
: org-lms-send-missing-subtree


