org-lms.org
** MAYBE Canvas-inspect

Maybe deprecate/eliminate this? 

I don't use this but the idea is that I'm supposed to be able to lok at the output of a request in a file. 

#+begin_src emacs-lisp
(defun org-lms-canvas-inspect (query &optional request-type request-params)
  "Send QUERY to `org-lms-baseurl' with http request type `type', using `org-lms-token' to authenticate.

Return an error if `org-lms-oauth' is unset. Otherwise return a list whose car is a parsed json
payload and whose cdr is an error message. The data payload will be a list, produced by `json-read' 
with thefollowing settings:

`json-array-type' 'list
`json-object-type' 'plist
`json-key-type' 'symbol

maybe key-type needs to be keyword though! Still a work in progress.
"
  (unless request-type
    (setq request-type "GET"))
  (let ((canvas-payload nil)
        (canvas-err nil)
        (canvas-status nil)

        )
    ;; (message (concat org-lms-baseurl query))
    ;; (message (concat "Bearer " org-lms-token))
    ;; (message "%s" `(("Authorization" . ,(concat "Bearer " org-lms-token))))
    (if org-lms-token
        (progn
          (setq thisrequest
                (request
                 (concat org-lms-baseurl query)
                 :type request-type
                 :headers `(("Authorization" . ,(concat "Bearer " org-lms-token)))
                 :sync t
                 :data (if  request-params request-params nil)
                 :parser 'buffer-string
                 :success (cl-function
                           (lambda (&key data &allow-other-keys)
                             (setq canvas-payload data)
                             (when data
                               (with-current-buffer (get-buffer-create "*request demo*")
                                 (erase-buffer)
                                 (insert data)
                                 (pop-to-buffer (current-buffer))
                                 (json-mode)
                                 (json-mode-beautify))))
                           )
                 :error (cl-function (lambda (&rest args  &key error-thrown &allow-other-keys)
                                       (setq canvas-err error-thrown)
                                       (message "ERROR: %s" error-thrown)))
                 ))
          ;; (message "pPAYLOAD: %s" canvas-payload)
          (if (request-response-data thisrequest)
              canvas-payload
            (error (format "NO PAYLOAD: %s" canvas-err)))
          ) 
      (user-error "Please set a value for for `org-lms-token' in order to complete API calls"))))
#+end_src


** Paste zoom recording links
Lately I have to paste these links a lot. It gets tedious. Here's a solution.

#+begin_src emacs-lisp
(defun org-lms-munge-zoom-link ()
  "Turn the zoom link from an email into an org list item"
  (interactive)
  (let ((today (format-time-string "%B %d"))
        (s (or (and (use-region-p)
                    (buffer-substring-no-properties (region-beginning) (region-end)))
               (current-kill 0 t))))
    (insert   (replace-regexp-in-string "^.*?\\(https://.*?\\) \\(Passcode: \\)\\(.*?\\) ?$"
                                        (concat "
- [[\\1][Recording from " today ":]] \\2 *\\3*") s))))


#+end_src

#+RESULTS:
: org-lms-munge-zoom-link

* Moribund minor-mode
It would be nice to define a minor mode that set the coure up properly, but there's a bit of a ways to go before I do that .

** ACTION WIM functions

This is now working; place these functions next to their topically-appropriate siblings. 
 
Copying the excellent "do what I mean" scope from [[https://github.com/kaushalmodi/ox-hugo/][ox-hugo]] as ~org-lms-0get-valid-subtree~, which checks parent headers for the ~EXPORT_FILE_NAME~ property before setting the subtree scope of export.

** Completely ad-hoc function designed exclusively for my own purposes

#+begin_src emacs-lisp

(defun org-lms-announcement-wim ()
  "move point to top level subtree, then, since we want 
to keep announcement creation super-lightweight, *always* export that 
headline. Need to decide whether this is the best course of action of course.  gaah."
  (interactive)
  ;; don't test here because we'll actually do it below.
  ;;(if (string= (org-lms-get-keyword "ORG_LMS_SECTION") "announcement"))
  (save-excursion
    (let ((subtree (org-lms--get-valid-subtree)))
      (org-lms-headline-to-announcement)
      )))

(defun org-lms-subtree-to-slack-wim ()
  "don't move point to top level subtree, since we want 
to keep announcement creation super-lightweight. *always*  
copy that subtree as slack text for posting to slack."
  (interactive)
    (save-excursion
    (let (;;(subtree (org-lms--get-valid-subtree))
          )
      (org-mark-subtree)
      (org-slack-export-to-clipboard-as-slack)
      )))

(defun isassignment (entry)
  (member "assignment" (org-get-tags )))
(defun org-lms-assignment-wim ()
  "post current asisgnment to org-lms as an assignment, using wim criteria"
  (interactive)
  (save-window-excursion
    (widen)
    (save-excursion
      (let* (
             (subtree (org-lms--get-valid-subtree 'isassignment)))
        (if subtree
            (progn
              (org-lms-post-assignment-and-save)              )
          (message "Couldn't find a valid subtree!!! Not posted."))
        ))))

;; TODO: detect if grade should be boolean or normal
(defun org-lms-grades-wim ()
  "set grade in current subtree, set state to ready, and advance to next grade"
  (interactive)
  (org-lms-set-grade)
  ;;(org-todo "READY")
  ;;(org-forward-heading-same-level 1)
  )

(defun org-lms-wim-wim ()
  "test for org-lms-section, then perform the appropriate wim function"
  (interactive)
  (pcase (org-lms-get-keyword "ORG_LMS_SECTION")
    ((pred (string= "announcement")) (org-lms-announcement-wim))
    ((pred (string= "assignment")) (org-lms-assignment-wim))
    ((pred (string= "slides")) (org-lms-slides-wim))
    ((pred (string= "grades")) (org-lms-grades-wim))
    ((pred (string= "lecture")) (org-lms-export-reveal-wim-to-html))
    ((pred (string= "syllabus")) (org-lms-post-syllabus))
    (- (progn (message "no section foind, please set the \"ORG_LMS_SECTION\" keyword.") nil)))
  )

#+end_src

#+RESULTS:
: org-lms-wim-wim

** Preliminary mode defn
- define a key map prefix (C-c C-x ?)
- add hook to ctrl-c ctrl-c; if in thism ode, and in announcements, announcement-wim; if in lectures, lslides-wim; if in grades... etc.  
#+begin_src emacs-lisp
;; Minor mode definition. I'm not really using it right now, but it
;; might be a worthwhile improvement.
 
(define-minor-mode org-lms-mode
  "a mode to get my grading and other lms interacitons in order"
  :init-value nil
  :global nil
  :keymap  (let ((map (make-sparse-keymap))) 
             (define-key map (kbd "C-c C-x C-g") 'org-lms-set-grade )
             (define-key map (kbd "C-c <f12>") 'org-lms-wim-wim)
             (define-key map (kbd "C-c 0 a") 'org-lms-post-assignment)
             (define-key map (kbd "C-c 0 p") 'org-lms-post-page)
             (define-key map (kbd "C-c 0 n") 'org-lms-headline-to-announcement)
             (define-key map (kbd "C-c 0 i") 'org-lms-module-item-from-headline)

             (define-key map (kbd "C-c o z") 'org-lms-munge-zoom-link)
             map )
  :lighter " LMS"
  ;;(mwp-toggle-macros)
  (if org-lms-mode
      (progn
        (add-hook 'org-ctrl-c-ctrl-c-final-hook 'org-lms-wim-wim))

    (remove-hook 'org-ctrl-c-ctrl-c-hinal-hook 'org-lms-wim-wim))
  )



#+end_src

#+RESULTS:
| keymap | (3 keymap (24 keymap (7 . o-l-set-grade))) |

* library closing

#+begin_src emacs-lisp
(provide 'org-lms)
;;; org-lms ends here
#+end_src
