org-lms.el
  "Send QUERY to `org-lms-baseurl' with http request type `type', using `org-lms-token' to authenticate.

Return an error if `org-lms-oauth' is unset. Otherwise return a list whose car is a parsed json
payload and whose cdr is an error message. The data payload will be a list, produced by `json-read' 
with thefollowing settings:

`json-array-type' 'list
`json-object-type' 'plist
`json-key-type' 'symbol

maybe key-type needs to be keyword though! Still a work in progress.
"
  (unless request-type
    (setq request-type "GET"))
  (let ((canvas-payload nil)
        (canvas-err nil)
        (canvas-status nil)

        )
    ;; (message (concat org-lms-baseurl query))
    ;; (message (concat "Bearer " org-lms-token))
    ;; (message "%s" `(("Authorization" . ,(concat "Bearer " org-lms-token))))
    (if org-lms-token
        (progn
          (setq thisrequest
                (request
                 (concat org-lms-baseurl query)
                 :type request-type
                 :headers `(("Authorization" . ,(concat "Bearer " org-lms-token)))
                 :sync t
                 :data (if  request-params request-params nil)
                 :parser 'buffer-string
                 :success (cl-function
                           (lambda (&key data &allow-other-keys)
                             (setq canvas-payload data)
                             (when data
                               (with-current-buffer (get-buffer-create "*request demo*")
                                 (erase-buffer)
                                 (insert data)
                                 (pop-to-buffer (current-buffer))
                                 (json-mode)
                                 (json-mode-beautify))))
                           )
                 :error (cl-function (lambda (&rest args  &key error-thrown &allow-other-keys)
                                       (setq canvas-err error-thrown)
                                       (message "ERROR: %s" error-thrown)))
                 ))
          ;; (message "pPAYLOAD: %s" canvas-payload)
          (if (request-response-data thisrequest)
              canvas-payload
            (error (format "NO PAYLOAD: %s" canvas-err)))
          ) 
      (user-error "Please set a value for for `org-lms-token' in order to complete API calls"))))

(defun org-lms-announcement-wim ()
  "move point to top level subtree, then, since we want 
to keep announcement creation super-lightweight, *always* export that 
headline."
  (interactive)
  (if (string= (org-lms-get-keyword "ORG_LMS_SECTION") "announcement")
      (save-excursion
        (let ((subtree (org-lms--get-valid-subtree)))
          (org-lms-headline-to-announcement)
          ))))

(defun mwp-subtree-to-slack-wim ()
  "move point to top level subtree, then, since we want 
to keep announcement creation super-lightweight, *always*  
copy that subtree as slack text for posting to slack."
  (interactive)
    (save-excursion
    (let ((subtree (org-lms--get-valid-subtree)))
      (org-mark-subtree)
      (org-slack-export-to-clipboard-as-slack)
      )))


(defun org-lms-assignment-wim ()
  "post current asisgnment to org-lms, using wim criteria"
  (interactive)
  (save-window-excursion
    (widen)
    (save-excursion
      (let ((subtree (org-lms--get-valid-subtree)))
        (if subtree
            (progn
              (org-lms-post-assignment-and-save)              )
          (message "Couldn't find a valid subtree!!! Not posted."))
        ))))

;; TODO: detect if grade should be boolean or normal
(defun org-lms-grades-wim ()
  "set grade in current subtree, set state to ready, and advance to next grade"
  (interactive)
  (org-lms-set-grade)
  (org-todo "READY")
  (org-forward-heading-same-level 1))

(defun org-lms-wim-wim ()
  "test for org-lms-section, then perform the appropriate wim function"
  (interactive)
  (pcase (org-lms-get-keyword "ORG_LMS_SECTION")
    ("announcement" (org-lms-announcement-wim))
    ("assignment" (org-lms-assignment-wim))
    ("slides" (org-lms-slides-wim))
    ("grades" (org-lms-grades-wim))
    )
  )

;; Minor mode definition. I'm not really using it right now, but it
;; might be a worthwhile improvement.
(defun o-l-set-grade ()
(call-interactively (org-set-property "GRADE"))) 
(define-minor-mode org-lms-mode
  "a mode to get my grading and other lms interacitons in order"
  :init-value nil
  :global nil
  :keymap  (let ((map (make-sparse-keymap))) 
             (define-key map (kbd "C-c C-x C-g") 'o-l-set-grade )
             map )
  :lighter " Mark"
  (mwp-toggle-macros)
  (if org-lms-mode
      (progn
        (add-hook 'org-ctrl-c-ctrl-c-final-hook 'org-lms-wim-wim))

    (remove-hook 'org-ctrl-c-ctrl-c-hinal-hook 'org-lms-wim-wim))
  )

(provide 'org-lms)
;;; org-lms ends here
